Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/algorithmbandweighttab.po
Languages: es, uk_ua

source: Algorithm band weight
es: Peso de banda del algoritmo
uk_ua: Вага каналу для алгоритму

source: |weight_tool| :guilabel:`Algorithm band weight`
es: |weight_tool| :guilabel:`Peso de banda del algoritmo`
uk_ua: |weight_tool| :guilabel:`Вага каналу для алгоритму`

source: This tab allows for the definition of band weights that are useful for improving the spectral separability of materials at certain wavelengths (bands). During the classification process, band values and spectral signature values are multiplied by the corresponding band weights, thus modifying the spectral distances. A tab is displayed for every :ref:`band_set_tab`.
es: Esta pestaña permite la definición de pesos de banda que son útiles para mejorar la separabilidad espectral de materiales en ciertas longitudes de onda (bandas). Durante el proceso de clasificación, los valores de banda y los valores de firma espectral se multiplican por los pesos de banda correspondientes, modificando así las distancias espectrales. Se muestra una pestaña para cada: ref: `band_set_tab`.

source: Band weight
es: Peso de banda
uk_ua: Вага каналу

source: |input_table| :guilabel:`Band weight`: table containing the following fields;
es: |input_table| :guilabel:`Peso de banda`: tabla conteniendo los siguientes campos;
uk_ua: |input_table| :guilabel:`Вага каналу`: таблиця містить наступні поля;

source: :guilabel:`Band number` : number of the band in the :guilabel:`Band set`;
es: :guilabel:`Número de banda` : número de la banda en el :guilabel:`Conjunto de bandas`;
uk_ua: :guilabel:`Номер каналу` : номер каналу в :guilabel:`Набір каналів`;

source: :guilabel:`Band name` : name of the band;
es: :guilabel:`Nombre de banda` : nombre de la banda;
uk_ua: :guilabel:`Назва каналу` : назва каналу;

source: :guilabel:`Weight` : weight of the band; this value can be edited;
es: :guilabel:`Peso` : peso de la banda; este valor puede ser editado;
uk_ua: :guilabel:`Вага` : ваговий коефіцієнт каналу; це значення редагується;

source: Automatic weight
es: Peso automático
uk_ua: Автоматична вага

source: |reset|: reset all band weights to 1;
es: |reset|: restaurar todos los pesos de las bandas a 1;
uk_ua: |reset|: повернути вагові коефіцієнти всіх каналів до 1;

source: :guilabel:`Set weight` |input_number| |enter|: set the defined value as weight for all the highlighted bands in the table;
es: :guilabel:`Asignar peso` |input_number| |enter|: asignar como peso de banda el valor definido para todas las bandas seleccionadas en la table;
uk_ua: :guilabel:`Призначити вагу` |input_number| |enter|: встановити визначене значення як ваговий коефіцієнт для всіх виділених в таблиці каналів;
