Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/bandsetlisttab.po
Languages: es

source: Band set list
es: Lista de conjunto de bandas

source: |bandset_tool| :guilabel:`Band set list`
es: |bandset_tool| :guilabel:`Lista de conjunto de bandas`

source: This tab allows for the management of :guilabel:`band sets` defined in :ref:`band_set_tab`.
es: Esta pestaña permite la gestión de :guilabel:`band sets` defined in :ref:`band_set_tab`.

source: It is possible to order or remove multiple :guilabel:`band sets` at once. Double click the list to set the :guilabel:`active band set` (i.e. the tab selected in :ref:`band_set_definition` with bold green name).
es: Es posible pedir o eliminar varios: guilabel: `conjuntos de bandas` a la vez. Haga doble clic en la lista para configurar: guilabel: `active band set` (es decir, la pestaña seleccionada en: ref:` band_set_definition` con el nombre verde en negrita).

source: It is also possible to export and import multiple :guilabel:`band sets` saved as file ``.scpb`` .
es: También es posible exportar e importar varios: guilabel: `conjuntos de bandas` guardados como archivo`` .scpb`` .

source: |input_table| :guilabel:`Band set list`: table containing the following fields;
es: |input_table| :guilabel:`Band set list`: tabla que contiene los siguientes campos;

source: :guilabel:`Number` |project_save|: number of the :guilabel:`band set`; cannot be edited;
es: :guilabel:`Number` |project_save|: número de el: guilabel: `band set`; no se puede editar;

source: :guilabel:`Bands` |project_save|: bands of the :guilabel:`band set`; cannot be edited;
es: :guilabel:`Bands` |project_save|: bandas de: guilabel: `band set`; no se puede editar;

source: |move_up|: move highlighted bands upward;
es: |move_up|: mueve las bandas seleccionadas hacia arriba;

source: |move_down|: move highlighted bands downward;
es: |move_down|: mueve las bandas seleccionadas hacia abajo;

source: |rgb_tool|: create a RGB :ref:`color_composite_definition` for highlighted :guilabel:`band sets`;
es: |rgb_tool|: crea un RGB: ref: `color_composite_definition` para resaltado: guilabel:` band sets`;

source: |remove|: remove highlighted :guilabel:`band set`;
es: |remove|: eliminar resaltado :guilabel:`band set`;

source: |export|: export :guilabel:`band set list` to a file (i.e. ``.scpb``);
es: |export|: exportar :guilabel:`band set list` a un archivo (i.e. ``.scpb``);

source: |import|: import a previously saved :guilabel:`band set list` from file (i.e. ``.scpb``);
es: |import|: importar un archivo: guilabel: `band set list` previamente guardado (es decir ,`` .scpb``);
