Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/classificationdilationtab.po
Languages: es, uk_ua

source: Classification dilation
es: Dilatación de la Clasificación
uk_ua: Розширювання класифікації

source: |classification_dilation| :guilabel:`Classification dilation`
es: |classification_dilation| :guilabel:`Dilatación de la Clasificación`
uk_ua: |classification_dilation| :guilabel:`Розширювання класифікації`

source: This tab allows for dilating the border of a class patch, defining the class values to be dilated and the number of pixels from the border. It is useful for classification refinement.
es: Esta pestaña permite la dilatación del borde de una mancha de Clase, definiendo los valores de la Clase a ser dilatada y el número de pixeles desde el borde. Es útil para el refinamiento de la clasificación.
uk_ua: Ця вкладка забезпечує розширювання меж фрагмента певного класу на підставі визначених значень класу розширювання та кількості пікселів межі. Дана операція зручна для покращення класифікації.

source: This tool supports ``virtual raster output``; if the output file name ends with ``.vrt`` then the output is created as virtual raster composed of as many ``.tif`` files as the number of CPU threads defined in :ref:`system_processing`; for large rasters this can speed up the process.
es: Esta herramienta admite ''salida ráster virtual''; si el nombre del archivo de salida termina con ''.vrt'', la salida se crea como ráster virtual compuesto por varios archivos ''.tif'' como el número de subprocesos de CPU definidos en :ref:'system_processing'; para rásteres grandes, esto puede acelerar el proceso.

source: :guilabel:`Select the classification` |input_list|: select a raster (already loaded in QGIS);
es: :guilabel:`Selecciona la clasificación` |input_list|: selecciona un ráster (ya cargado en QGIS);
uk_ua: :guilabel:`Вибрати класифікацію` |input_list|: вибрати растр (попередньо завантажений до QGIS);

source: |reload|: refresh layer list;
es: |reload|: recargar la lista de capas;
uk_ua: |reload|: оновити перелік шарів;

source: :guilabel:`Class values` |input_text|: set the class values to be dilated; class values must be separated by ``,`` and ``-`` can be used to define a range of values (e.g. ``1, 3-5, 8`` will select classes 1, 3, 4, 5, 8); if the text is red then the expression contains errors;
es: :guilabel:`Valores de Clase` |input_text|: establece los valores de Clase que serán dilatados; los valores de Clase pueden estar separados por ``,`` y ``-`` pueden ser usados para definir rangos de valores (Ej. ``1, 3-5, 8`` seleccionará las Clases 1, 3, 4, 5, 8); si el texto está rojo es porque la expresión contiene errores;
uk_ua: :guilabel:`Значення класу` |input_text|: призначити значення класу для розширювання; значення класу повинні бути розділені ``,`` та ``-`` може використовуватись для визначення діапазону значень (наприклад, ``1, 3-5, 8`` вибере класи 1, 3, 4, 5, 8); якщо текст червоний, то вираз містить помилки;

source: :guilabel:`Size in pixels` |input_number|: number of pixels to be dilated from the border;
es: :guilabel:`Tamaño en pixeles` |input_number|: número de pixeles que serán dilatados desde el borde;
uk_ua: :guilabel:`Розмір в пікселях` |input_number|: кількість пікселів, які будуть розширені від межі;

source: |checkbox| :guilabel:`Circular` |optional|: if checked, the dilation will be circular, similar to a buffer;
es: |checkbox| :guilabel:`«Circular» |opcional|: si se comprueba, la dilatación será circular, similar a un buffer;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: choose the output destination and start the calculation;
es: :guilabel:`RUN` |run|: elija el destino de salida y comience el cálculo;

source: :guilabel:`Pixel connection` |input_list|: select the type of pixel connection:
uk_ua: :guilabel:`Зв'язність пікселів` |input_list|: вибрати тип зв'язності пікселів:

source: :guilabel:`4`: in a 3x3 window, diagonal pixels are not considered connected;
uk_ua: :guilabel:`4`: у вікні 3x3 діагональні пікселі вважаються незв'язними;

source: :guilabel:`8`: in a 3x3 window, diagonal pixels are considered connected;
uk_ua: :guilabel:`8`: у вікні 3x3 діагональні пікселі вважаються зв'язними;
