Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/classificationsievetab.po
Languages: es

source: Classification sieve
es: Filtrado de la Clasificación

source: |classification_sieve| :guilabel:`Classification sieve`
es: |classification_sieve| :guilabel:`Filtrado de la clasificación`

source: This tab allows for the replacement of isolated pixel values with the value of the largest neighbour patch (based on `GDAL Sieve <http://www.gdal.org/gdal_sieve.html>`_ ). It is useful for removing small patches from a classification.
es: Esta pestaña permite reemplazar valores de pequeños pixeles aislados con los valores con los del polígono vecino más grande (basado en `GDAL Sieve <http://www.gdal.org/gdal_sieve.html>`_ ). Es útil para remover manchas de la clasificación.

source: :guilabel:`Select the classification` |input_list|: select a raster (already loaded in QGIS);
es: :guilabel:`Selecciona la clasificación` |input_list|: selecciona un ráster (ya cargado en QGIS);

source: |reload|: refresh layer list;
es: |reload|: recargar la lista de capas;

source: :guilabel:`Size threshold` |input_number|: size of the patch to be replaced (in pixel unit); all patches smaller the the selected number of pixels will be replaced by the value of the largest neighbour patch;
es: :guilabel:`Tamaño de umbral` |input_number|: tamaño de la mancha que será reemplazada (en unidades de pixel); todas las manchas más pequeñas que el número fijado serán reemplazadas por el valor del vecino cercano más grande;

source: :guilabel:`Pixel connection` |input_list|: select the type of pixel connection:
es: :guilabel:`Conexión de pixeles` |input_list|: selecciona el tipo de conexión de pixeles:

source: :guilabel:`4`: in a 3x3 window, diagonal pixels are not considered connected;
es: :guilabel:`4`: en una ventana 3x3, los pixeles diagonales no son considerados conectados;

source: :guilabel:`8`: in a 3x3 window, diagonal pixels are considered connected;
es: :guilabel:`8`: en una ventana 3x3, los pixeles diagonales son considerados conectados;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: choose the output destination and start the calculation;
es: :guilabel:`RUN` |run|: elija el destino de salida y comience el cálculo;
