Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/clipmultiplerasterstab.po
Languages: es

source: Clip multiple rasters
es: Recortar múltiples rásters

source: |clip_tool| :guilabel:`Clip multiple rasters`
es: |clip_tool| :guilabel:`Recortar múltiples rásters`

source: This tab allows for cutting several image bands at once, using a rectangle defined with point coordinates or a boundary defined with a vector.
es: Esta pestaña permite cortar varias bandas de la imagen a la vez, utilizando un rectángulo definido con coordenadas de puntos o un límite definido con un vector.

source: Clip band set
es: Cortar conjunto de bandas

source: :guilabel:`Select input band set` |input_number|: select the input :ref:`band_set_tab` to be clipped;
es: : guilabel: `Seleccionar conjunto de bandas de entrada` | número_entrada |: seleccionar la entrada: ref:` band_set_tab` a recortar;

source: |checkbox| :guilabel:`Use value as NoData` |input_number|: if checked, set the value for ``NoData`` pixels (e.g. pixels outside the clipped area);
es: |checkbox|: guilabel: `Usar valor como NoData` | input_number |: si está marcado, establezca el valor para los píxeles` `NoData '' (por ejemplo, píxeles fuera del área recortada);

source: :guilabel:`Output name prefix` |input_text|: set the prefix for output file names (default is ``clip``);
es: :guilabel:`Prefijo para nombre de salida` |input_text|: establece el prefijo para los nombres de los archivos de salida (por defecto es ``clip``);

source: Clip coordinates
es: Coordenadas de corte

source: Set the Upper Left (UL) and Lower Right (LR) point coordinates of the rectangle used for clipping; it is possible to enter the coordinates manually. Alternatively use a vector.
es: Establezca las coordenadas de los puntos superior izquierdo (SI) e inferior derecho (ID) del rectángulo utilizado para el recorte; Es posible ingresar las coordenadas manualmente. Alternativamente, use un vector.

source: :guilabel:`UL X` |input_number|: set the UL X coordinate;
es: :guilabel:`UL X` |input_number|: establecer la coordenada UL X;

source: :guilabel:`UL Y` |input_number|: set the UL Y coordinate;
es: :guilabel:`UL Y` |input_number|: establecer la coordenada UL Y;

source: :guilabel:`LR X` |input_number|: set the LR X coordinate;
es: :guilabel:`LR X` |input_number|: establecer la coordenada LR X;

source: :guilabel:`LR Y` |input_number|: set the LR Y coordinate;
es: :guilabel:`LR Y` |input_number|: establecer la coordenada LR Y;

source: |radiobutton| :guilabel:`Show`: show or hide the clip area drawn in the map;
es: |radiobutton| :guilabel:`Mostrar`: muestra u oculta el área de corte dibujada en el mapa;

source: |pointer|: define a clip area by drawing a rectangle in the map; left click to set the UL point and right click to set the LR point; the area is displayed in the map;
es: |pointer|: define el área de corte dibujando un rectángulo en el mapa; clic izquierdo para establecer el punto UL y clic derecho para establecer el punto LR; el área es mostrada en el mapa;

source: |checkbox| :guilabel:`Use vector for clipping` |input_list|: if checked, use the selected vector (already loaded in QGIS) for clipping; UL and LR coordinates are ignored;
es: | casilla de verificación | : guilabel: `Usar vector para recorte` | input_list |: si está marcado, use el vector seleccionado (ya cargado en QGIS) para el recorte; Las coordenadas SI y ID se ignoran;

source: |checkbox| :guilabel:`Use vector field for output name` |input_list|: if checked, a vector field is selected for clipping while iterating through each vector polygon and the corresponding field value is added to the output name;
es: | casilla de verificación | : guilabel: `Usar campo de vector para nombre de salida` | input_list |: si está marcado, se selecciona un campo de vector para recortar mientras itera a través de cada polígono de vector y el valor del campo correspondiente se agrega al nombre de salida;

source: |checkbox| :guilabel:`Use temporary ROI for clipping`: if checked, use a :ref:`temporary_ROI` for clipping; UL and LR coordinates are ignored;
es: |checkbox|: guilabel: `Usar ROI temporal para el recorte`: si está marcado, use a: ref:` temporary_ROI` para el recorte; Se ignoran las coordenadas UL y LR

source: |reload|: refresh layer list;
es: |reload|: recargar la lista de capas;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: choose an output destination and clip rasters in the selected ``Band set``;
es: : guilabel: `RUN` | run |: elige un destino de salida y recorte los rásteres del `Conjunto de bandas '' seleccionado;
