Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/cloudmaskingtab.po
Languages: es

source: Cloud masking
es: Enmascaramiento de nubes

source: |cloud_masking_tool| :guilabel:`Cloud masking`
es: |cloud_masking_tool| :guilabel:`Enmascaramiento de nubes`

source: This tool allows for cloud masking, based on the values of a raster mask, creating an output masked band for each band of the :ref:`band_set_tab`. ``NoData`` is set in all the bands of the :ref:`band_set_tab` for pixels corresponding to clouds.
es: Esta herramienta permite el enmascaramiento de las nubes, basado en los valores de una máscara ráster, creando una banda enmascarada de salida para cada banda del:ref:`band_set_tab`. ``NoData`` se establece en todas las bandas de la :ref:`band_set_tab` para píxeles correspondientes a nubes.

source: Mask of band set
es: Conjunto de máscara de banda

source: :guilabel:`Select input band set` |input_number|: select the input :ref:`band_set_tab` to be masked;
es: :guilabel:`Seleccionar el conjunto de banda de entrada` |input_number|: seleccione la entrada:ref:`band_set_tab` a ser enmascarado;

source: :guilabel:`Select the classification` |input_list|: select a classification raster (already loaded in QGIS) which contains a cloud class;
es: :guilabel:`Seleccione la clasificación` |input_list|: seleccione un raster de clasificacion (ya cargado en QGIS) que contiene una clase de nube;

source: |reload|: refresh layer list;
es: |reload|: recargar la lista de capas;

source: :guilabel:`Mask class values` |input_text|: set the class values to be masked; class values must be separated by ``,`` and ``-`` can be used to define a range of values (e.g. ``1, 3-5, 8`` will select classes 1, 3, 4, 5, 8); if the text is red then the expression contains errors;
es: :guilabel:`Valores de clase de máscara` |input_text|:establecer los valores de la clase que se enmascararán; los valores de clase deben estar separados por ``,`` y ``-`` se puede usar para definir un rango de valores (por ejemplo ``1, 3-5, 8`` seleccionará las clases 1, 3, 4, 5, 8); si el texto es rojo, entonces la expresión contiene errores;

source: |checkbox| :guilabel:`Use buffer of pixel size` |input_number|: if checked, a buffer is created for masked area, corresponding to the defined number of pixels; this can be useful to dilate masked area in case the mask doesn't cover the thinner border of clouds;
es: |checkbox| :guilabel:`Usar buffer del tamaño del píxel` |input_number|: si está marcado, se crea un búfer para el área enmascarada, correspondiente al número definido de píxeles; esto puede ser útil para dilatar el área enmascarada en caso de que la máscara no cubra el borde más delgado de las nubes;

source: :guilabel:`Output NoData value` |input_number|: set the value of ``NoData`` pixels corresponding to clouds;
es: `Output NoData value` | input_number |: establece el valor de los píxeles` `NoData '' correspondientes a las nubes;

source: :guilabel:`Output name prefix` |input_text|: set the prefix for output file names (default is ``mask``);
es: :guilabel:`Prefijo del nombre de salida` |input_text|: establecer el prefijo para los nombres de los archivos de salida (por defecto es ``mask``);

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: select an output directory and start the mask process;
es: :guilabel:`RUN` |run|: seleccione un directorio de salida e inicie el proceso de máscara;
