Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/clusteringtab.po
Languages: es

source: Clustering
es: Agrupamiento

source: |clustering| :guilabel:`Clustering`
es: |clustering| :guilabel:`Agrupamiento`

source: This tab allows for the :ref:`clustering_definition` of a :ref:`band_set_tab`. In particular, :ref:`kmeans_definition` and :ref:`isodata_definition` methods are available.
es: Esta pestaña permite :ref:`clustering_definition` de un :ref:`band_set_tab`. En particular, :ref:`kmeans_definition` y :ref:`isodata_definition` los métodos están disponibles.

source: A report .txt is saved along with the classification, containing the class spectral signature and the spectral distance thereof.
es: Se guarda un informe .txt junto con la clasificación, que contiene la firma espectral de la clase y la distancia espectral de la misma.

source: Clustering of band set
es: Agrupación de conjunto de bandas

source: :guilabel:`Select input band set` |input_number|: select the input :ref:`band_set_tab`;
es: :guilabel:`Seleccionar el conjunto de banda de entrada` |input_number|: seleccione la entrada: ref:`band_set_tab`;

source: :guilabel:`Method` |radiobutton| :guilabel:`K-means` |radiobutton| :guilabel:`ISODATA`: select the clustering method :ref:`kmeans_definition` or :ref:`isodata_definition`;
es: :guilabel:`Method` |radiobutton| :guilabel:`K-means` |radiobutton| :guilabel:`ISODATA`:seleccione el método de agrupamiento :ref:`kmeans_definition` o :ref:`isodata_definition`;

source: |checkbox| :guilabel:`Distance threshold` |input_number|: if checked, for K-means: iteration is terminated if distance is lower than threshold; for ISODATA: signatures are merged if distance is greater than threshold;
es: |checkbox| :guilabel:`Umbral de distancia` |input_number|: si está marcada, para K-means: la iteración termina si la distancia es inferior al umbral; para ISODATA: las firmas se fusionan si la distancia es mayor que el umbral;

source: :guilabel:`Number of classes` |input_number|: number of desired output classes;
es: :guilabel:`Numero de clases` |input_number|: numero de clases de salida deseadas;

source: :guilabel:`Max number of iterations` |input_number|: maximum number of iterations if :guilabel:`Distance threshold` is not reached;
es: :guilabel:`Número máximo de iteraciones.` |input_number|: número máximo de iteraciones si :guilabel:`Umbral de distancia` no se alcanza;

source: :guilabel:`ISODATA max standard deviation` |input_number|: maximum standard deviation considered for splitting a class, for :guilabel:`ISODATA` algorithm only;
es: :guilabel:`Desviación estándar máxima de ISODATA` |input_number|:desviación estándar máxima considerada para dividir una clase, para :guilabel:`ISODATA` un solo algoritmo;

source: :guilabel:`ISODATA minimum class size in pixels` |input_number|: desired minimum class size in pixels, for :guilabel:`ISODATA` algorithm only;
es: :guilabel:`Tamaño mínimo de clase ISODATA en píxeles` |input_number|: tamaño de clase mínimo deseado en píxeles, para :guilabel:`ISODATA` un solo algoritmo;

source: |checkbox| :guilabel:`Use value as NoData` |input_number|: if checked, set the value of ``NoData`` pixels, ignored during the calculation;
es: |checkbox| :guilabel:`Usar valor como NoData` | input_number |: si está marcado, establezca el valor de los píxeles` `NoData '', ignorados durante el cálculo;

source: Seed signatures
es: Firmas de semillas

source: |radiobutton| :guilabel:`Seed signatures from band values` |radiobutton| :guilabel:`Use Signature list as seed signatures` |radiobutton| :guilabel:`Use random seed signatures`: select one options for seed signatures that start the iteration; the option :guilabel:`Seed signatures from band values` divides the spectral space of the :ref:`band_set_tab` to get spectral signatures; the option :guilabel:`Use Signature list as seed signatures` uses the spectral signatures checked in :ref:`ROI_list`; the option :guilabel:`Use random seed signatures` randomly selects the spectral signatures of pixels in the :ref:`band_set_tab`;
es: |radiobutton| :guilabel:`Firmas de semillas de valores de banda` |radiobutton| :guilabel:`Utilice la lista de firmas como firmas semilla` |radiobutton| :guilabel:`Use firmas de semillas aleatorias`:seleccione una opción para las firmas semilla que inician la iteración; la opción :guilabel:`Firmas de semillas de valores de banda` divide el espacio espectral de la:ref:`band_set_tab` para obtener firmas espectrales; la opción :guilabel:`Utilice la lista de firmas como firmas semilla` utiliza las firmas espectrales registradas :ref:`ROI_list`; la opción:guilabel:`Use firmas de semillas aleatorias` selecciona aleatoriamente las firmas espectrales de píxeles en el :ref:`band_set_tab`;

source: :guilabel:`Distance algorithm` |radiobutton| :guilabel:`Minimum Distance` |radiobutton| :guilabel:`Spectral Angle Mapping`: select :ref:`minimum_distance_algorithm` or * :ref:`spectra_angle_mapping_algorithm` for spectral distance calculation;
es: :guilabel:`Algoritmo de distancia` |radiobutton| :guilabel:`Distancia minima` |radiobutton| :guilabel:`Mapeo de Ángulo Espectral`: seleccione :ref:`minimum_distance_algorithm` o * :ref:`spectra_angle_mapping_algorithm` para cálculo de distancia espectral;

source: |checkbox| :guilabel:`Save resulting signatures to Signature list`: if checked, save the resulting spectral signatures in the :ref:`ROI_list`;
es: |checkbox| :guilabel:`Guardar firmas resultantes en la lista de firmas`: si está marcado, guarde las firmas espectrales resultantes en el :ref:`ROI_list`;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: choose the output destination and start the calculation;
es: :guilabel:`RUN` |run|: elija el destino de salida y comience el cálculo;
