Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/debugtab.po
Languages: uk_ua

source: Debug
uk_ua: Налагодження

source: :guilabel:`Debug`
uk_ua: :guilabel:`Налагодження`

source: Debugging utilities for the creation of a Log file (i.e. recording of :guilabel:`SCP` activities for reporting issues) and testing :guilabel:`SCP` dependencies.
uk_ua: Інструменти налагодження для створення файлу журналу (тобто запису дій :guilabel:`SCP` для повідомлення про проблеми) та перевірки залежностей :guilabel:`SCP` dependencies.

source: If you found a plugin error, please read :ref:`error_0` .
uk_ua: Якщо ви виявили помилку модуля, будь ласка читайте :ref:`error_0` .

source: Log file
uk_ua: Файл журналу

source: |checkbox| :guilabel:`Records events in a log file` |registry_save|: if checked, start recording events in a Log file;
uk_ua: |checkbox| :guilabel:`Записувати події до файлу журналу` |registry_save|: якщо параметр увімкнено, то розпочати запис подій до файлу журналу;

source: |export|: export the Log file (i.e. a .txt file);
uk_ua: |export|: експортувати файл журналу (тобто файл .txt);

source: |reset|: clear the content of Log file;
uk_ua: |reset|: очистити зміст файлу журналу;

source: Test
uk_ua: Перевірка

source: :guilabel:`Test dependencies` |enter|: test :guilabel:`SCP` dependencies (GDAL, GDAL subprocess, NumPy, SciPy, Matplotlib, Internet connection); results are displayed in a window;
uk_ua: :guilabel:`Перевірка залежностей` |enter|: перевірити залежності :guilabel:`SCP` (GDAL, підпроцеси GDAL, NumPy, SciPy, Matplotlib, Інтернет-з'єднання); результати перевірки відображаються у вікні;
