Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/editrastertab.po
Languages: es, uk_ua

source: Edit raster
es: Editar ráster
uk_ua: Редагувати растр

source: |edit_raster| :guilabel:`Edit raster`
es: |edit_raster| :guilabel:`Editar ráster`
uk_ua: |edit_raster| :guilabel:`Редагувати растр`

source: This tab allows for the direct editing of pixel values in a raster. Only pixels beneath ROI polygons or vector polygons are edited.
es: Esta pestaña permite la edición directa de los valores de los pixeles en un ráster. Solo los pixeles que están debajo de polígonos ROI o polígonos vectoriales son editados.
uk_ua: Ця вкладка забезпечує безпосереднє редагування значень пікселів растра. Редагуються лише пікселі, що знаходяться під полігонами ROI або векторними полігонами.

source: **WARNING**: the input raster is directly edited; it is recommended to create a **backup copy** of the input raster before using this tool in order to prevent data loss.
es: ** ADVERTENCIA **: el ráster de entrada se edita directamente; se recomienda crear una ** copia de seguridad ** del ráster de entrada antes de usar esta herramienta para evitar la pérdida de datos.

source: This tool can rapidly edit large rasters, especially when editing polygons are small, because pixel values are edited directly. In addition, the :ref:`toolbar_edit_raster` is available for easing the raster editing using multiple values.
es: Esta herramienta permite editar rápidamente rásters grandes, especialmente cuando los polígonos de edición son pequeños, debido a que los valores de píxel son editados directamente. Adicionalmente, la :ref:`toolbar_edit_raster` está disponible para facilitar la edición de ráster usando múltiples valores.
uk_ua: Завдяки безпосередньому редагуванню значень пікселів цей інструмент може швидко редагувати великі растри, особливо у випадку маленьких полігонів редагування. Також для спрощення редагування растрів з застосуванням декількох значень доступна :ref:`toolbar_edit_raster`.

source: :guilabel:`Select the input raster` |input_list|: select a raster (already loaded in QGIS);
es: :guilabel:`Selecciona el ráster de entrada` |input_list|: selecciona un ráster (ya cargado en QGIS);
uk_ua: :guilabel:`Вибрати входовий растр` |input_list|: вибрати растр (попередньо завантажений до QGIS);

source: |reload|: refresh layer list;
es: |reload|: recargar la lista de capas;
uk_ua: |reload|: оновити перелік шарів;

source: Edit raster values
es: Editar valores de un ráster
uk_ua: Редагувати значення растра

source: |radiobutton| :guilabel:`Edit values using ROI polygons`: if checked, raster is edited using temporary ROI polygons in the map;
es: |radiobutton| :guilabel:`Editar valores usando polígonos ROI`: si está seleccionado, el ráster es editado usando polígonos de ROI temporales existentes en el mapa;
uk_ua: |radiobutton| :guilabel:`Редагувати значення, застосовуючи полігони ROI`: якщо опцію уівмкнено, то растр редагується з застосуванням тимчасових полігонів ROI на карті;

source: |radiobutton| :guilabel:`Edit values using a vector` |input_list|: if checked, raster is edited using all the polygons of selected vector;
es: |radiobutton| :guilabel:`Editar valores usando vectorial` |input_list|: si está seleccionado, el ráster es editado usando todos los polígonos del archivo vectorial seleccionado;
uk_ua: |radiobutton| :guilabel:`Редагувати значення, застосовуючи вектор` |input_list|: якщо опцію увімкнено, то растр редагується з застосуванням всіх полігонів вибраного вектора;

source: Edit options
es: Opciones de Edición
uk_ua: Параметри редагування

source: |checkbox| :guilabel:`Use the value field of the vector` |input_list|: if checked, raster is edited using the selected vector (in :guilabel:`Edit values using a vector`) and the polygon values of selected vector field;
es: |checkbox| :guilabel:`Usar el valor del campo del vector` |input_list|: si está seleccionado, el ráster es editado usando el vectorial seleccionado (en :guilabel:`Editar valores usando vectorial`) y los valores de los campos de los polígonos del vectorial seleccionado;
uk_ua: |checkbox| :guilabel:`Використати поле значень вектора` |input_list|: якщо параметр увімкнено, то растр редагується з застосуванням вибраного вектора (у :guilabel:`Редагувати значення, застосовуючи вектор`) та значень полігонів вибраного атрибутивного поля вектора;

source: |checkbox| :guilabel:`Use constant value` |input_number|: if checked, raster is edited using the selected constant value;
es: |checkbox| :guilabel:`Usar un valor constante` |input_number|: si está seleccionado, el ráster es editado utilizando el valor constante elegido;
uk_ua: |checkbox| :guilabel:`Використати постійне значення` |input_number|: якщо параметр увімкнено, то растр редагується з використанням вибраного постійного значення;

source: |checkbox| :guilabel:`Use expression` |input_text|: if checked, raster is edited according to the entered expression; the expression must contain one or more ``where``; accepted variable are ``raster`` representing the input raster value and ``vector`` representing the vector value if selected; the following example expression ``where(raster == 1, 2, raster)`` is already entered, which sets 2 where ``raster`` equals 1, and leaves unchanged the values where ``raster`` is not equal to 1;
es: |checkbox| :guilabel:`Usar expresión` |input_text|:si está marcado, el ráster se edita de acuerdo con la expresión ingresada; la expresión debe contener uno o más `` where``; las variables aceptadas son `` ráster '' que representa el valor ráster de entrada y `` vector '' que representa el valor del vector si se selecciona; el siguiente ejemplo de expresión `` where (raster == 1, 2, raster) '' ya está ingresado, que establece 2 donde `` raster`` es igual a 1, y deja sin cambios los valores donde `` raster`` no es igual a 1;

source: |undo_edit_raster|: undo the last raster edit (available only when using ROI polygons);
es: |undo_edit_raster|: deshace la última edición ráster (disponible solamente cuando se utiliza polígonos ROI);
uk_ua: |undo_edit_raster|: відмінити останню правку растра (доступно лише у випадку використання полігонів ROI);

source: :guilabel:`RUN` |run|: edit the raster;
es: :guilabel:`RUN` |run|: editar el ráster;
