Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/importsignaturestab.po
Languages: es, uk_ua

source: Import signatures
es: Importar firmas
uk_ua: Імпорт сигнатур

source: The tab |import_spectral_library| :guilabel:`Import signatures` allows for importing spectral signatures from various sources.
es: La pestaña |import_spectral_library| :guilabel:`Importar firmas` permite importar firmas espectrales desde varias fuentes.
uk_ua: Вкладка |import_spectral_library| :guilabel:`Імпорт сигнатур` забезпечує імпортування спектральних сигнатур з різних джерел.

source: Import library file
es: Importar archivo de librería
uk_ua: Імпортувати файл бібліотеки

source: :guilabel:`Import library file`
es: :guilabel:`Importar archivo de librería`
uk_ua: :guilabel:`Імпортувати файл бібліотеки`

source: This tool allows for importing spectral signatures from various sources: a previously saved :ref:`training_input` (.scp file); a USGS Spectral Library (.asc file); a previously exported CSV file. In case of USGS Spectral Library, the library is automatically sampled according to the image band wavelengths defined in the :ref:`band_set_tab`, and added to the :ref:`ROI_list`;
es: Esta herramienta permite importar firmas espectrales desde varias fuentes: de un :ref:`training_input` (.scp file) guardado anteriormente; una USGS Spectral Library (archivo .asc); un archivo CSV exportado anteriormente. Para elc aso de una USGS Spectral Library, la librería es muestreada automáticamente conforme a los anchos de banda definidos en el :ref:`band_set_tab`, y agregadas al :ref:`ROI_list`;
uk_ua: Цей інструмент забезпечує імпортування спектральних сигнатур з різних джерел: завчасно збережених :ref:`training_input` (файл .scp); спектральної бібілотеки USGS (файл .asc); завчасно експортований файл CSV. У випадку використання спектральної бібліотеки USGS з неї автоматично відбираються зразки відповідно до довжин хвиль каналів, зазначених в :ref:`band_set_tab`, та додаються до :ref:`ROI_list`;

source: :guilabel:`Select a file` |open_file|: open a file to be imported in the :ref:`training_input`;
es: :guilabel:`Selecciona un archivo` |open_file|: abre un archivo para ser importado en el :ref:`training_input`;
uk_ua: :guilabel:`Вибрати файл` |open_file|: відкрити файл для імпорту до :ref:`training_input`;

source: Import shapefile
es: Importar archivo shape
uk_ua: Імпортувати шейпфайл

source: :guilabel:`Import shapefile`
es: :guilabel:`Importar archivo shape`
uk_ua: :guilabel:`Імпортувати шейпфайл`

source: This tool allows for importing a shapefile, selecting the corresponding fields of the :ref:`training_input`.
es: Esta herramienta permite importar un archivo shape, seleccionando los campos correspondientes al :ref:`training_input`.
uk_ua: Цей інструмент забезпечує імпортування шейпфайлу з вибором відповідних полів :ref:`training_input`.

source: :guilabel:`Select a shapefile` |open_file|: open a shapefile;
es: :guilabel:`Selecciona un archivo shape` |open_file|: abre un archivo shape;
uk_ua: :guilabel:`Вибрати шейпфайл` |open_file|: відкрити шейпфайл;

source: :guilabel:`MC ID field` |input_list|: select the shapefile field corresponding to MC ID;
es: :guilabel:`Campo MC ID` |input_list|: selecciona del archivo shape el campo correspondiente a MC ID;
uk_ua: :guilabel:`Поле MC ID` |input_list|: вибрати поле шейпфайлу, яке відповідає MC ID;

source: :guilabel:`C ID field` |input_list|: select the shapefile field corresponding to C ID;
es: :guilabel:`Campo C ID` |input_list|: selecciona del archivo shape el campo correspondiente a C ID;
uk_ua: :guilabel:`Поле C ID` |input_list|: вибрати поле шейпфайлу, яке відповідає C ID;

source: |checkbox| :guilabel:`Calculate sig.`: if checked, the spectral signature is calculated while the ROI is saved to :ref:`training_input`;
es: |checkbox| :guilabel:`Calcular firm.`: si está seleccionado, la firma espectral es calculada mientras el ROI es guardado en el :ref:`training_input`;
uk_ua: |checkbox| :guilabel:`Розрахувати сиг.`: якщо увімкнено, під час збереження ROI до :ref:`training_input` буде розрахована її спектральна сигнатура;

source: :guilabel:`Import shapefile` |enter|: import all the shapefile polygons as ROIs in the :ref:`training_input`;
es: :guilabel:`Importar shape` |enter|: importa todos los polígonos del archivo shape como ROIs en el :ref:`training_input`;
uk_ua: :guilabel:`Імпортувати шейпфайл` |enter|: імпортувати всі полігони шейпфайлу, як ROI до :ref:`training_input`;

source: Download USGS Spectral Library
es: Descarga Librería Espectral de USGS
uk_ua: Завантажити спектральну бібліотеку USGS

source: :guilabel:`Download USGS Spectral Library`
es: :guilabel:`Descarga Librería Espectral de USGS`
uk_ua: :guilabel:`Завантажити спектральну бібліотеку USGS`

source: The tab :guilabel:`Download USGS Spectral Library` allows for the download of the `USGS spectral library <http://speclab.cr.usgs.gov/spectral-lib.html>`_ (Clark, R.N., Swayze, G.A., Wise, R., Livo, E., Hoefen, T., Kokaly, R., Sutley, S.J., 2007, USGS digital spectral library splib06a: U.S. Geological Survey, Digital Data Series 231).
es: La pestaña :guilabel:`Descarga Librería Espectral de USGS` permite la descarga de la `USGS spectral library <http://speclab.cr.usgs.gov/spectral-lib.html>`_ (Clark, R.N., Swayze, G.A., Wise, R., Livo, E., Hoefen, T., Kokaly, R., Sutley, S.J., 2007, USGS digital spectral library splib06a: U.S. Geological Survey, Digital Data Series 231).
uk_ua: Вкладка :guilabel:`Завантажити спектральну бібліотеку USGS` забезпечує завантаження `Спектральної бібліотеки USGS <http://speclab.cr.usgs.gov/spectral-lib.html>`_ (Clark, R.N., Swayze, G.A., Wise, R., Livo, E., Hoefen, T., Kokaly, R., Sutley, S.J., 2007, USGS digital spectral library splib06a: U.S. Geological Survey, Digital Data Series 231).

source: The libraries are grouped in chapters including Minerals, Mixtures, Coatings, Volatiles, Man-Made, Plants, Vegetation Communities, Mixtures with Vegetation, and Microorganisms. An internet connection is required.
es: Las librerías están agrupadas en capítulos incluyendo Minerals, Mixtures, Coatings, Volatiles, Man-Made, Plants, Vegetation Communities, Mixtures with Vegetation, and Microorganisms. Se requiere una conexión a Internet.
uk_ua: Бібліотеки об'єднані в розділи, які включають мінерали, суміші, покриття, леткі сполуки, антропогенні об'єкти, рослини, рослинні угруповання, рідини з рослинністю, мікроорганізми. Необхідне інтернет-з'єднання.

source: :guilabel:`Select a chapter` |input_list|: select one of the library chapters; after the selection, chapter libraries are shown in :guilabel:`Select a library`;
es: :guilabel:`Selecciona un capítulo` |input_list|: selecciona uno de los capítulos de la librería; después de que selecciones, las librerías de ese capítulo son mostradas en :guilabel:`Selecciona una librería`;
uk_ua: :guilabel:`Вибрати розділ` |input_list|: вибрати один з розділів бібліотеки; після здійснення вибору бібліотеки розділу відображаються у :guilabel:`Вибрати бібліотеку`;

source: :guilabel:`Select a library` |input_list|: select one of the libraries; the library description is displayed in the frame :guilabel:`Library description`;
es: :guilabel:`Selecciona una librería` |input_list|: selecciona una de las librerías; la descripción de la librería es mostrada en el marco :guilabel:`Descripción de la Librería`;
uk_ua: :guilabel:`Вибрати бібліотеку` |input_list|: вибрати одну з бібліотек; опис бібліотеки відображається у секції :guilabel:`Опис бібілотеки`;

source: :guilabel:`Import spectral library` |enter|: download the library and add the sampled spectral signature to the :ref:`ROI_list` using the parameters defined for class and macroclass; the library is automatically sampled according to the image band wavelengths defined in the :guilabel:`active band set` in :ref:`band_set_tab`, and added to the :ref:`ROI_list`;
es: : guilabel: `Importar biblioteca espectral` | enter |: descargue la biblioteca y agregue la firma espectral muestreada a: ref:` ROI_list` utilizando los parámetros definidos para clase y macroclase; la biblioteca se muestrea automáticamente de acuerdo con las longitudes de onda de la banda de la imagen definidas en: guilabel: `conjunto de bandas activas` en: ref:` band_set_tab`, y se agrega a: ref: `ROI_list`;
