Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/interfacepo.po
Languages: pt_br

source: The Interface of SCP
pt_br: A Interface do SCP

source: The :guilabel:`SCP` interface is composed of several parts that are described in detail in the following paragraphs.
pt_br: A interface :guilabel:`SCP` é composta de diversas partes que são descritas em detalhe nos seguintes parágrafos.

source: The functions described in the following paragraphs use these conventions:
pt_br: As funções descritas nos parágrafos seguintes usam estas convenções:

source: |input_date| = Input date
pt_br: |input_date| = Entrada de dados

source: |input_text| = Input text
pt_br: |input_text| = Entrada de texto

source: |input_list| = List
pt_br: |input_list| = Lista

source: |input_number| = Input number
pt_br: |input_number| = Entrada de números

source: |optional| = Optional
pt_br: |optional| = Opcional

source: |project_save| = Configuration stored in the active project of QGIS
pt_br: |project_save| = Configuração arquivada no projeto ativo do QGIS

source: |registry_save| = Configuration stored in QGIS registry
pt_br: |registry_save| = Configuração arquivada no registro do QGIS

source: |input_slider| = Slider
pt_br: |input_slider| = Controle deslizante

source: |input_table| = Table
pt_br: |input_table| = Tabela
