Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/interfacetab.po
Languages: es, uk_ua

source: Interface
es: Interfaz
uk_ua: Інтерфейс

source: Customization of the interface.
es: Personalización de la interfaz.
uk_ua: Пристосування інтерфейсу до вимог користувача.

source: :guilabel:`Interface`
es: :guilabel:`Interfaz`
uk_ua: :guilabel:`Інтерфейс`

source: Field names of training input
es: Nombres de campo del Entrada de Entrenamiento
uk_ua: Імена полів входових навчальних даних

source: Set the names of fields in the :ref:`training_input` . Changing field names should usually be avoided.
es: Establece los nombres de campo en el :ref:`training_input` . El cambio de los nombres de campo por regla general debe ser evitado.
uk_ua: Призначити імена полів :ref:`training_input` . Змінювати імена полів не рекомендовано.

source: :guilabel:`MC ID field` |input_text| |registry_save|: name of the Macroclass ID field (default is ``MC_ID``);
es: :guilabel:`Campo MC ID` |input_text| |registry_save|: nombre del campo ID de la Macroclase (por defecto ``MC_ID``);
uk_ua: :guilabel:`Поле MC ID` |input_text| |registry_save|: ім'я поля унікального ідентифікатора макрокласу (стандартно ``MC_ID``);

source: :guilabel:`C ID field` |input_text| |registry_save|: name of the Class ID field (default is ``C_ID``);
es: :guilabel:`Campo C ID` |input_text| |registry_save|: nombre del campo ID de la Clase (por defecto is ``C_ID``);
uk_ua: :guilabel:`Поле C ID` |input_text| |registry_save|: ім'я поля унікального ідентифікатора класу (стандартно ``C_ID``);

source: |reset|: reset field names to default;
es: |reset|: restaura los nombres de campo a los valores por defecto;
uk_ua: |reset|: повернутись до стандартних імен полів;

source: ROI style
es: Estilo del ROI
uk_ua: Стиль ROI

source: Change ROI color and transparency for a better visualization of temporary ROIs on the map.
es: Cambia el color y la transparencia del ROI para una mejor visualización de los ROIs temporales en el mapa.
uk_ua: Змінити колір та прозорість ROI для кращого відображення тимчасових ROI на карті.

source: :guilabel:`ROI color` |registry_save|: button for changing ROI color;
es: :guilabel:`Color del ROI` |registry_save|: botón para cambiar el color del ROI;
uk_ua: :guilabel:`Колір ROI` |registry_save|: кнопка зміни кольору ROI;

source: :guilabel:`Transparency` |input_slider| |registry_save|: change ROI transparency;
es: :guilabel:`Transparencia` |input_slider| |registry_save|: cambia la transparencia del ROI;
uk_ua: :guilabel:`Прозорість` |input_slider| |registry_save|: змінити прозорість ROI;

source: |reset|: reset ROI color and transparency to default;
es: |reset|: restaura el color y la transparencia del ROI a los valores por defecto;
uk_ua: |reset|: повернутись до стандартних кольору та прозорості ROI;

source: Variable name for expressions
es: Nombre de variable para expresiones
uk_ua: Ім'я змінної у виразах

source: Set the variable name used in expressions of the :ref:`reclassification_tab` and :ref:`edit_raster_tab` .
es: Establece el nombre de variable usado por las expresiones en la :ref:`reclassification_tab` y :ref:`edit_raster_tab` .
uk_ua: Призначити ім'я змінної, що використовується у виразах :ref:`reclassification_tab` та :ref:`edit_raster_tab` .

source: :guilabel:`Variable name` |input_text| |registry_save|: set variable name (default is ``raster``);
es: :guilabel:`Nombre de variable` |input_text| |registry_save|: establece el nombre de variable (por defecto ``raster``);
uk_ua: :guilabel:`Ім'я змінної` |input_text| |registry_save|: призначити ім'я змінної (стандартно ``raster``);

source: |reset|: reset variable name to default;
es: |reset|: restaura el nombre de la variable al nombre por defecto;
uk_ua: |reset|: повернутись до стандартного імені змінної;

source: Temporary group name
es: Nombre temporal de grupo
uk_ua: Ім'я тимчасової групи

source: Set the temporary group name in QGIS Layers used for temporary layers .
es: Establece el Nombre temporal de grupo en el Panel de Capas de QGIS usado por las capas temporales .
uk_ua: Призначити ім'я тимчасової групи, що використовується для тимчасових шарів, в панелі шарів QGIS.

source: :guilabel:`Group name` |input_text| |registry_save|: set group name (default is ``Class_temp_group``);
es: :guilabel:`Nombre de grupo` |input_text| |registry_save|: establece el nombre de grupo (por defecto ``Class_temp_group``);
uk_ua: :guilabel:`Ім'я групи` |input_text| |registry_save|: призначити ім'я групи (стандартно ``Class_temp_group``);

source: |reset|: reset group name to default;
es: |reset|: restaura el nombre de grupo al valor por defecto;
uk_ua: |reset|: повернутись до стандартного імені групи;

source: Dock
es: Panel
uk_ua: Панель
