Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/landsattab.po
Languages: es, uk_ua

source: This tab allows for the conversion of **Landsat 1, 2, and 3 MSS** and **Landsat 4, 5, 7, and 8** images from DN (i.e. Digital Numbers) to the physical measure of Top Of Atmosphere reflectance (TOA), or the application of a simple atmospheric correction using the DOS1 method (Dark Object Subtraction 1), which is an image-based technique (for more information about the Landsat conversion to TOA and DOS1 correction, see :ref:`conversion_to_reflectance`).
es: Esta pestaña permite la conversión de imágenes ** Landsat 1, 2 y 3 MSS ** y ** Landsat 4, 5, 7 y 8 ** de DN (es decir, números digitales) a la medida física de reflectancia en la parte superior de la atmósfera. (TOA), o la aplicación de una corrección atmosférica simple usando el método DOS1 (Dark Object Subtraction 1), que es una técnica basada en imágenes (para obtener más información sobre la conversión Landsat a TOA y corrección DOS1, consulte: ref: `conversion_to_reflectance `).

source: Once the input is selected, available bands are listed in the metadata table.
es: Cuando el directorio de entrada se selecciona, las bandas disponibles se listan en la tabla de Metadatos
uk_ua: Щойно визначено входові дані, доступні канали перераховуються в таблиці метаданих.

source: Pan-sharpening is also available; for more information read :ref:`pan_sharpening_definition`. The panchromatic band is preprocessed only if pansharpening is checked.
es: También está disponible el Pan-sharpening; para más información lea: ref: `pan_sharpening_definition`. La banda pancromática se procesa previamente solo si se marca el Pan-sharpening.

source: **WARNING**: For the best spectral precision you should download the Landsat Level-2 Data Products (Surface Reflectance) from https://earthexplorer.usgs.gov .
es: ** ADVERTENCIA **: para obtener la mejor precisión espectral, debe descargar los productos de datos Landsat Level-2 (Reflectancia de superficie) desde https://earthexplorer.usgs.gov.

source: Landsat conversion to TOA reflectance and brightness temperature
es: Conversión a reflectancia TOA y a temperatura de brillo de imágenes Landsat
uk_ua: Перерахунок даних Landsat у відбивальність TOA та яскравісну температуру

source: :guilabel:`Directory containing Landsat bands` |open_dir|: open a directory containing Landsat bands; names of Landsat bands must end with the corresponding number; if the metadata file is included in this directory then :ref:`landsat_metadata` are automatically filled;
es: :guilabel:`Directorio conteniendo bandas Landsat` |open_dir|: abre un directorio conteniendo bandas Landsat; los nombres de las bandas Landsat deben terminar en su número correspondiente; si el archivo con metadatos está incluido en este directorio el :ref:`landsat_metadata` se completa automáticamente;
uk_ua: :guilabel:`Каталог з каналами Landsat` |open_dir|: відкриває каталог, який містить канали Landsat; назви каналів Landsat повинні завершуватись відповідним номером; якщо в цьому каталозі міститься файл метаданих, то :ref:`landsat_metadata` заповнюється автоматично;

source: :guilabel:`Select MTL file` |open_file| |optional|: if the metadata file is not included in the :guilabel:`Directory containing Landsat bands`, select the path of the metadata file in order to fill the :ref:`landsat_metadata` automatically;
es: :guilabel:`Seleccionar archivo MTL` |open_file| |optional|: si el archivo con los metadatos no está incluido en el :guilabel:`Directorio conteniendo bandas Landsat`, selecciona la ruta del archivo con metadatos para completar el :ref:`landsat_metadata` automáticamente;
uk_ua: :guilabel:`Вибрати MTL файл` |open_file| |optional|: якщо файл метаданих не міститься в :guilabel:`Каталог з каналами Landsat`, то вкажіть шлях до файлу метаданих, щоб автоматично заповнити :ref:`landsat_metadata`;

source: |checkbox| :guilabel:`Brightness temperature in Celsius`: if checked, convert brightness temperature to Celsius (if a Landsat thermal band is listed in :ref:`landsat_metadata`); if unchecked temperature is in Kelvin;
es: |checkbox| :guilabel:`Temperatura de brillo en Celsius`: si está seleccionada, convierte la temperatura de brillo a Celsius (si la banda Landsat termal está listada en :ref:`landsat_metadata`); si no está seleccionado la temperatura está en Kelvin;
uk_ua: |checkbox| :guilabel:`Яскравісна температура в градусах Цельсія`: якщо опцію увімкнено, то яскравісна температура перераховується в градуси за Цельсієм (якщо термальний канал Landsat наведений в :ref:`landsat_metadata`); якщо опцію вимкнено, то температура в градусах Кельвіна;

source: |checkbox| :guilabel:`Apply DOS1 atmospheric correction`: if checked, the :ref:`DOS1_correction` is applied to all the bands (thermal bands excluded);
es: |checkbox| :guilabel:`Aplicar la corrección atmosférica DOS1`: si está seleccionado, la :ref:`DOS1_correction` es aplicada a todas las bandas (excluyendo la banda termal);
uk_ua: |checkbox| :guilabel:`Застосувати атмосферне коректування DOS1`: якщо опцію увімкнено, то :ref:`DOS1_correction` застосовується до всіх каналів (за виключенням термальних);

source: |checkbox| :guilabel:`Use value as NoData` |input_number|: if checked, pixels having ``NoData`` value are not counted during conversion and the DOS1 calculation of DNmin; it is useful when image has a black border (usually pixel value = 0);
es: | casilla de verificación | : guilabel: `Usar valor como NoData` | input_number |: si está marcado, los píxeles que tienen el valor` `NoData '' no se cuentan durante la conversión y el cálculo DOS1 de DNmin; es útil cuando la imagen tiene un borde negro (normalmente el valor del píxel = 0);

source: |checkbox| :guilabel:`Perform pan-sharpening`: if checked, a Brovey Transform is applied for the :ref:`pan_sharpening_definition` of Landsat bands;
es: |checkbox| :guilabel:`Realizar pansharpening`: si está seleccionado, la transformación Brovey es aplicada para la :ref:`pan_sharpening_definition` de las bandas Landsat;
uk_ua: |checkbox| :guilabel:`Виконати паншарпенинг`: якщо опцію увімкнено, то для :ref:`pan_sharpening_definition` каналів Landsat застосовується перетворення Брові;

source: |checkbox| :guilabel:`Create Band set and use Band set tools`: if checked, bands are added to the active :guilabel:`Band set` after the conversion; also, the :guilabel:`Band set` is processed according to the tools checked in the :ref:`band_set_tab`;
es: |checkbox| :guilabel: `Crear conjunto de bandas y usar herramientas del conjunto de bandas`: si está marcado, las bandas se agregan al activo: guilabel:` Conjunto de bandas` después de la conversión;

source: |checkbox| :guilabel:`Add bands in a new Band set`: if checked, bands are added to a new empty :guilabel:`Band set` after the conversion;
es: |checkbox| : guilabel: `Agregar bandas en un nuevo conjunto de bandas`: si está marcado, las bandas se agregan a uno nuevo vacío: guilabel:` Grupo de bandas` después de la conversión;

source: Metadata
es: Metadatos
uk_ua: Метадані

source: All the bands found in the :guilabel:`Directory containing Landsat bands` are listed in the table :guilabel:`Metadata`. If the Landsat metadata file (a .txt or .met file with the suffix MTL) is provided, then :guilabel:`Metadata` are automatically filled. For information about :guilabel:`Metadata` fields read `this page <http://landsat.usgs.gov/Landsat8_Using_Product.php>`_ and `this one <http://landsat.usgs.gov/how_is_radiance_calculated.php>`_ .
es: Todas las bandas encontradas en el :guilabel:`Directorio conteniendo bandas Landsat` son listadas en la tabla :guilabel:`Metadatos`. Si se encuentra el archivo de metadatos (un archivo .txt o .met con el sujito MTL) , los :guilabel:`Metadatos` son llenados automáticamente. Para información sobre los campos :guilabel:`Metadatos` lee `esta página <http://landsat.usgs.gov/Landsat8_Using_Product.php>`_ y `esta otra <http://landsat.usgs.gov/how_is_radiance_calculated.php>`_ .
uk_ua: Всі канали, що знаходяться в :guilabel:`Каталог, який містить канали Landsat` наведені в таблиці :guilabel:`Метадані`. Якщо наявний файл метаданих Landsat (.txt або .met файл з суфіксом MTL), то :guilabel:`Метадані` заповнюються автоматично. Для інформації щодо полів :guilabel:`Метадані` читайте `цю сторінку <http://landsat.usgs.gov/Landsat8_Using_Product.php>`_ та `цю <http://landsat.usgs.gov/how_is_radiance_calculated.php>`_ .

source: :guilabel:`Satellite` |input_text|: satellite name (e.g. Landsat8);
es: :guilabel:`Satélite` |input_text|: el nombre del satélite (Ej. Landsat8);
uk_ua: :guilabel:`Супутник` |input_text|: назва супутника (наприклад, Landsat8);

source: :guilabel:`Date` |input_text|: date of acquisition (e.g. 2013-04-15);
es: :guilabel:`Date` |input_text|: fecha de adquisición (por ejemplo, 2013-04-15);

source: :guilabel:`Sun elevation` |input_number|: Sun elevation in degrees;
es: :guilabel:`Elevación del Sol` |input_number|: elevación del Sol en grados;
uk_ua: :guilabel:`Висота сонця` |input_number|: Висота сонця в градусах;

source: :guilabel:`Earth sun distance` |input_number|: Earth Sun distance in astronomical units (automatically calculated if :guilabel:`Date` is filled;
es: :guilabel:`Distancia Tierra-Sol` |input_number|: distancia de la Tierra al Sol en unidades astronómicas (calculada automáticamente si :guilabel:`Date` está llenada;
uk_ua: :guilabel:`Відстань між Землею та Сонцем` |input_number|: відстань між Землею та Сонцем в астрономічних одиницях (розраховується автоматично, якщо :guilabel:`Дата` заповнена);

source: |remove|: remove highlighted bands from the table :guilabel:`Metadata`;
es: |remove|: elimina las bandas seleccionadas de la tabla :guilabel:`Metadatos`;
uk_ua: |remove|: видалити виділені рядки з таблиці :guilabel:`Метадані`;

source: |input_table| :guilabel:`Metadata`: table containing the following fields;
es: |input_table| :guilabel:`Metadatos`: tabla conteniendo los siguientes campos;
uk_ua: |input_table| :guilabel:`Метадані`: таблиця містить наступні рядки;

source: :guilabel:`Band`: band name;
es: :guilabel:`Band`: nombre de banda;
uk_ua: :guilabel:`Канал`: назва каналу;

source: :guilabel:`RADIANCE_MULT`: multiplicative rescaling factor;
es: :guilabel:`RADIANCE_MULT`: factor multiplicativo para el reescalado;
uk_ua: :guilabel:`RADIANCE_MULT`: множильний коефіцієнт перемасштабовування;

source: :guilabel:`RADIANCE_ADD`: additive rescaling factor;
es: :guilabel:`RADIANCE_ADD`: factor aditivo para el reescalado;
uk_ua: :guilabel:`RADIANCE_ADD`: адитивний коефіцієнт перемасштабовування;

source: :guilabel:`REFLECTANCE_MULT`: multiplicative rescaling factor;
es: :guilabel:`REFLECTANCE_MULT`: factor multiplicativo para el reescalado;
uk_ua: :guilabel:`REFLECTANCE_MULT`: множильний коефіцієнт перемасштабовування;

source: :guilabel:`REFLECTANCE_ADD`: additive rescaling factor;
es: :guilabel:`REFLECTANCE_ADD`: factor aditivo para el reescalado;
uk_ua: :guilabel:`REFLECTANCE_ADD`: адитивний коефіцієнт перемасштабовування;

source: :guilabel:`RADIANCE_MAXIMUM`: radiance maximum;
es: :guilabel:`RADIANCE_MAXIMUM`: radiancia máxima;
uk_ua: :guilabel:`RADIANCE_MAXIMUM`: максимальна енергетична світність;

source: :guilabel:`REFLECTANCE_MAXIMUM`: reflectance maximum;
es: :guilabel:`REFLECTANCE_MAXIMUM`: reflectancia máxima;
uk_ua: :guilabel:`REFLECTANCE_MAXIMUM`: максимальна відбивальність;

source: :guilabel:`K1_CONSTANT`: thermal conversion constant;
es: :guilabel:`K1_CONSTANT`: constante de conversión termal;
uk_ua: :guilabel:`K1_CONSTANT`: стала термічного перерахунку;

source: :guilabel:`K2_CONSTANT`: thermal conversion constant;
es: :guilabel:`K2_CONSTANT`: constante de conversión termal;
uk_ua: :guilabel:`K2_CONSTANT`: стала термічного перерахунку;

source: :guilabel:`LMAX`: spectral radiance that is scaled to QCALMAX;
es: :guilabel:`LMAX`: radiancia espectral que es reescalada a QCALMAX;
uk_ua: :guilabel:`LMAX`: спектральна енергетична світність калібрована до QCALMAX;

source: :guilabel:`LMIN`: spectral radiance that is scaled to QCALMIN;
es: :guilabel:`LMIN`: radiancia espectral que es reescalada a QCALMIN;
uk_ua: :guilabel:`LMIN`: спектральна енергетична світність калібрована до QCALMIN;

source: :guilabel:`QCALMAX`: minimum quantized calibrated pixel value;
es: :guilabel:`QCALMAX`: valor máximo de pixel cuantificado y calibrado;
uk_ua: :guilabel:`QCALMAX`: мінімальне дискретизоване та каліброване значення пікселя;

source: :guilabel:`QCALMIN`: maximum quantized calibrated pixel value;
es: :guilabel:`QCALMIN`: valor mínimo de pixel cuantificado y calibrado;
uk_ua: :guilabel:`QCALMIN`: максимальне дискретизоване та каліброване значення пікселя;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: select an output directory and start the conversion process; only bands listed in the table :guilabel:`Metadata` are converted; converted bands are saved in the output directory with the prefix ``RT_`` and automatically loaded in QGIS;
es: : guilabel: `RUN` | run |: seleccione un directorio de salida e inicie el proceso de conversión; solo las bandas que figuran en la tabla: guilabel: se convierten los 'Metadatos'; las bandas convertidas se guardan en el directorio de salida con el prefijo `` RT_`` y se cargan automáticamente en QGIS;
