Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/modistab.po
Languages: uk_ua

source: This tab allows for the conversion of **MODIS** images to .tif format, and the reprojection to WGS 84.
uk_ua: Ця вкладка забезпечує перетворення знімків **MODIS** в формат .tif та перепроєктування у WGS 84.

source: Once the input is selected, available bands are listed in the metadata table.
uk_ua: Щойно визначено входові дані, доступні канали перераховуються в таблиці метаданих.

source: MODIS conversion
uk_ua: Перерахунок MODIS

source: :guilabel:`Select file MODIS` |open_file|: select a MODIS image (file .hdf);
uk_ua: :guilabel:`Вибрати файл MODIS` |open_file|: вибрати знімок MODIS (файл .hdf);

source: |checkbox| :guilabel:`Reproject to WGS 84`: if checked, reproject bands to WGS 84, required for use in :guilabel:`SCP`;
uk_ua: |checkbox| :guilabel:`Перепроєктувати у WGS 84`: якщо параметр увімкнено, то перепроєктувати канали у WGS 84, що вимагається для роботи в :guilabel:`SCP`;

source: Metadata
uk_ua: Метадані

source: All the bands found in the :guilabel:`Select file MODIS` are listed in the table :guilabel:`Metadata`. For information about :guilabel:`Metadata` fields visit `the MODIS page <https://lpdaac.usgs.gov/dataset_discovery/modis>`_ .
uk_ua: Всі канали, знайдені в :guilabel:`Вибрати файл MODIS` перераховуються в таблиці :guilabel:`Метадані`. Для інформації щодо полів :guilabel:`Метадані` відвідайте `сторінку MODIS <https://lpdaac.usgs.gov/dataset_discovery/modis>`_ .

source: :guilabel:`ID` |input_text|: ID of the image;
uk_ua: :guilabel:`ID` |input_text|: унікальний ідентифікатор знімка;

source: |remove|: remove highlighted bands from the table :guilabel:`Metadata`;
uk_ua: |remove|: видалити виділені рядки з таблиці :guilabel:`Метадані`;

source: |input_table| :guilabel:`Metadata`: table containing the following fields;
uk_ua: |input_table| :guilabel:`Метадані`: таблиця містить наступні рядки;

source: :guilabel:`Band`: band name;
uk_ua: :guilabel:`Канал`: назва каналу;

source: :guilabel:`UnitConversionCoeff`: value for conversion;
uk_ua: :guilabel:`КоефПерерахункуОдиниць`: значення для перерахунку;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
uk_ua: :guilabel:`BATCH` |batch_tool|: додати цю функцію до :ref:`batch_tab`;
