Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/mosaicbandsetstab.po
Languages: es

source: Mosaic band sets
es: Conjuntos de bandas del mosaico

source: |mosaic_tool| :guilabel:`Mosaic band sets`
es: |mosaic_tool| :guilabel:`Conjuntos de bandas del mosaico`

source: This tool allows for the mosaic of band sets, merging the corresponding bands of two or more band sets defined in the :ref:`band_set_tab`. An output band is created for every corresponding set of bands in the band sets.
es: Esta herramienta permite el mosaico de conjuntos de bandas, fusionando las bandas correspondientes de dos o más conjuntos de bandas definidos en el :ref:`band_set_tab`. Se crea una banda de salida para cada conjunto de bandas correspondiente en los conjuntos de bandas.

source: ``NoData`` values of one band set are replaced by the values of the other band sets.
es: Los valores `` NoData '' de un conjunto de bandas se reemplazan por los valores de los otros conjuntos de bandas.

source: Mosaic of band sets
es: Mosaico de conjuntos de bandas

source: :guilabel:`Band set list` |input_text|: list if band sets defined in the :ref:`band_set_tab`; in case of overlapping images, the pixel values of the first band set in the list are assigned.
es: :guilabel:`Band set list` |input_text|:lista si los conjuntos de bandas definidos en el :ref:`band_set_tab`;en caso de imágenes superpuestas, se asignan los valores de píxeles de la primera banda establecida en la lista.

source: |checkbox| :guilabel:`Use value as NoData` |input_number|: if checked, set the value of ``NoData`` pixels, ignored during the calculation;
es: |checkbox| :guilabel:`Usar valor como NoData` | input_number |: si está marcado, establezca el valor de los píxeles` `NoData '', ignorados durante el cálculo;

source: |checkbox| :guilabel:`Create virtual raster output` |optional|: if checked, output is created as virtual raster ``.vrt`` composed of as many ``.tif`` files as the number of threads defined in :ref:`system_processing`; for large rasters this can speed up the process;
es: |checkbox| :guilabel: Crear salida de ráster virtual` | opcional |: si está seleccionada, la salida se crea como ráster virtual `` .vrt`` compuesto por varios archivos `` .tif`` como el número de subprocesos definidos en: ref: `system_processing`; para rásteres grandes, esto puede acelerar el proceso;

source: :guilabel:`Output name prefix` |input_text|: set the prefix for output file names (default is ``mosaic``);
es: :guilabel:`Prefijo de nombre de salida` | input_text |: establece el prefijo para los nombres de archivo de salida (por defecto es ``mosaic``);

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: select an output directory and start the mosaic process;
es: :guilabel:`RUN` |run|: seleccione un directorio de salida e inicie el proceso del mosaico;
