Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/multipleroicreationtab.po
Languages: es

source: Multiple ROI Creation
es: Creación de ROI Múltiples

source: |roi_multiple| :guilabel:`Multiple ROI Creation`
es: |roi_multiple| :guilabel:`Creación de ROI múltiples`

source: This tab allows for the automatic creation of ROIs, useful for the rapid classification of multi-temporal images, or for accuracy assessment. Given a list of point coordinates and ROI options, this tool performs the region growing of ROIs. Created ROIs are automatically saved to the :ref:`training_input`. The :guilabel:`active band set` in :ref:`band_set_tab` is used for calculations.
es: Esta pestaña permite la creación automática de ROI, útil para la clasificación rápida de imágenes multitemporales o para la evaluación de precisión. Dada una lista de coordenadas de puntos y opciones de ROI, esta herramienta realiza el crecimiento regional de ROI. El ROI creado se guarda automáticamente en :ref:`training_input`. El :guilabel:`active band set` in :ref:`band_set_tab` se usa para cálculos.

source: Create random points
es: Crear puntos aleatorios

source: :guilabel:`Number of points` |input_number|: set a number of points that will be created when :guilabel:`Create points` |enter| is clicked;
es: :guilabel:`Número de puntos` |input_number|: establece la cantidad de puntos que serán creados cuando :guilabel:`Crear puntos` |enter| es presionado;

source: |checkbox| :guilabel:`inside grid` |input_number|: if checked, the :guilabel:`band set` area is divided in cells where the size thereof is defined in the combobox (image unit, usually meters); points defined in ``Number of random points`` are created randomly within each cell;
es: |checkbox| :guilabel:`inside grid` |input_number|: si está marcada, el área: guilabel: `band set` se divide en celdas donde el tamaño de las mismas se define en el cuadro combinado (unidad de imagen, generalmente metros); los puntos definidos en `` Número de puntos aleatorios '' se crean aleatoriamente dentro de cada celda;

source: |checkbox| :guilabel:`min distance` |input_number|: if checked, random points have a minimum distance defined in the combobox (image unit, usually meters); setting a minimum distance can result in fewer points than the number defined in :guilabel:`Number of points`;
es: |checkbox| :guilabel:`distancia min` |input_number|: si está seleccionado, los puntos aleatorios tienen como distancia mínima la definida en el cuadro combinado (en unidades de imagen, usualmente metros); establecer una distancia mínima puede producir menos puntos que el definido en :guilabel:`Número de puntos`;

source: :guilabel:`Create points` |enter|: create random points inside the :guilabel:`band set` area;
es: : guilabel: `Crear puntos` | enter |: crea puntos aleatorios dentro del área: guilabel:` conjunto de bandas`;

source: Point coordinates and ROI definition
es: Coordenadas de punto y definición de ROI

source: |input_table| :guilabel:`Point coordinates and ROI definition`: table containing the following fields;
es: |input_table| :guilabel:`Coordenadas de los Puntos y definición de ROI`: tabla conteniendo los siguientes campos;

source: :guilabel:`X` : point X coordinate (float);
es: :guilabel:`X` : coordenada X del punto (float);

source: :guilabel:`Y` : point Y coordinate (float);
es: :guilabel:`Y` : coordenada Y del punto (float);

source: :guilabel:`MC ID`: ROI Macroclass ID (int);
es: :guilabel:`MC ID`: ID de Macroclase del ROI (int);

source: :guilabel:`C ID`: ROI Class ID (int);
es: :guilabel:`C ID`: ID de Clase del ROI (int);

source: :guilabel:`Min` : the minimum area of a ROI (in pixel unit);
es: :guilabel:`Min` : el área mínima de un ROI (en unidades de pixel);

source: :guilabel:`Max` : the maximum width of a ROI (in pixel unit);
es: :guilabel:`Max` : el ancho máximo de un ROI (en unidades de pixel);

source: :guilabel:`Dist` : the interval which defines the maximum spectral distance between the seed pixel and the surrounding pixels (in radiometry unit);
es: :guilabel:`Dist` : el intervalo que define la máxima distancia espectral entre el pixel origen y los circundantes (en unidades radiométricas);

source: :guilabel:`Rapid ROI band` : if a band number is defined, ROI is created only using the selected band, similarly to :guilabel:`Rapid ROI band` in :ref:`ROI_list` ;
es: : guilabel: `Rapid ROI band`: si se define un número de banda, el ROI se crea solo con la banda seleccionada, de manera similar a: guilabel:` Rapid ROI band` en: ref: `ROI_list`;

source: |add|: add a new row to the table; all the table fields must be filled for the ROI creation;
es: |add|: agrega una nueva fila a la tabla; todos los campos de la tabla deben ser llenados para la creación del ROI;

source: |remove|: delete the highlighted rows from the table;
es: |remove|: elimina las filas seleccionadas de la tabla;

source: |export|: export the point list to text file;
es: |export|: exporta la lista de puntos a un archivo de texto;

source: |checkbox| :guilabel:`Calculate sig.`: if checked, the spectral signature is calculated while the ROI is saved to :ref:`training_input`;
es: |checkbox| :guilabel:`Calcular firm.`: si está seleccionado, la firma espectral es calculada mientras el ROI es guardado en el :ref:`training_input`;

source: :guilabel:`RUN` |run|: start the ROI creation process for all the points and save ROIs to the :ref:`training_input`;
es: : guilabel: `RUN` | run |: inicia el proceso de creación de ROI para todos los puntos y guarda los ROI en: ref:` training_input`;
