Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/processingsettingtab.po
Languages: es

source: Processing
es: Procesamiento

source: :guilabel:`Processing`
es: :guilabel:`Procesado`

source: System
es: Sistema

source: :guilabel:`Available RAM (MB)` |input_number| |registry_save|: set the available RAM (in MB) that is used during the processes in order to improve the :guilabel:`SCP` performance; this value should be half of the system RAM (e.g. 1024MB if system has 2GB of RAM); in case of errors, set a value lower than 512MB;
es: :guilabel:`RAM disponible (MB)` |input_number| |registry_save|: asigna la memoria RAM (en MB) disponible que es usada durante los procesos con el fin de mejorar el desempeño de :guilabel:`SCP` ; este valor debería ser la mitad de la RAM del sistema (Ej. 1024MB si el sistema tiene 2GB de RAM); en caso de errores, establezca a un valor menor que 512;

source: :guilabel:`CPU threads` |input_number| |registry_save|: set the number of threads available for processing; it is recommended to set a value lower than the maximum number of system threads (e.g. if the system has 4 available threads set value 3);
es: : guilabel: `Subprocesos del CPU` | input_number | | registration_save |: establece el número de subprocesos disponibles para su procesamiento; se recomienda establecer un valor inferior al número máximo de subprocesos del sistema (por ejemplo, si el sistema tiene 4 subprocesos disponibles, establezca el valor 3);

source: Classification process
es: Procesos para la Clasificación

source: |checkbox| :guilabel:`Play sound when finished` |registry_save|: if checked, play a sound when the classification process is completed;
es: |checkbox| :guilabel:`Reproducir sonido cuando termina` |registry_save|: si está seleccionado, reproduce un sonido cuando el proceso de clasificación se completa;

source: |checkbox| :guilabel:`Use virtual rasters for temp files` |registry_save|: if checked, create virtual rasters for certain temporary files, instead of creating real rasters; it is useful for reducing disk space usage during calculations;
es: |checkbox| :guilabel:`Usar ráster virtual para archivos temporales` |registry_save|: si está seleccionado, crea rásters virtuales para ciertos archivos temporales, en lugar de crear rásters reales; es útil para reducir el uso del espacio en disco durante los cálculos;

source: |checkbox| :guilabel:`Raster compression` |registry_save|: if checked, a lossless compression (DEFLATE or PACKBITS) is applied to raster outputs in order to save disk space; it is recommended to check this option, however compressed files are sometimes larger than files without compression;
es: |checkbox| :guilabel:`Compresión Ráster` |registry_save|: si está seleccionado, se aplica la compresión sin pérdidas (DEFLATE or PACKBITS) a los rásters de salida con el fin de ahorrar espacio en disco; es recomendable seleccionar esta opción, sin embargo los archivos comprimidos a veces son más grandes que los archivos sin comprimir;

source: |checkbox| :guilabel:`Enable writing verification` |registry_save|: if checked, the output raster is compared to output calculation in order to avoid writing errors; it can slow the process;
es: | casilla de verificación | : guilabel: `Habilitar verificación de escritura` | registry_save |: si está marcado, el ráster de salida se compara con el cálculo de salida para evitar errores de escritura; puede ralentizar el proceso;

source: SMTP process notification
es: Notificación de proceso SMTP

source: :guilabel:`SMTP server` |input_text| |registry_save|: the SMTP server to login for sending a notification email when all the :guilabel:`SCP` processes are finished (a notification is sent also in case of error, but not in case of crash);
es: :guilabel: `Servidor SMTP` |input_text| |registry_save|: el servidor SMTP para iniciar sesión para enviar un correo electrónico de notificación cuando todos los procesos: guilabel: `SCP` hayan finalizado (se envía una notificación también en caso de error, pero no en caso de bloqueo);

source: :guilabel:`user` |input_text| |registry_save|: the SMTP server user;
es: :guilabel:`user` |input_text| |registry_save|: el usuario del servidor SMTP;

source: :guilabel:`password` |input_text| |registry_save|: the SMTP server password;
es: :guilabel:`password` |input_text| |registry_save|: la contraseña del servidor SMTP;

source: :guilabel:`Send email of completed process to` |input_text| |registry_save|: a list of addresses (separated by comma) to send the notification email to;
es: : guilabel: `Enviar correo electrónico del proceso completado a` | input_text | | Registry_save |: una lista de direcciones (separadas por comas) para enviar el correo electrónico de notificación;

source: External programs
es: Programas externos

source: Some SCP tools require external programs to perform the processing.
es: Algunas herramientas de SCP requieren programas externos para realizar el procesamiento.

source: Temporary directory
es: Directorio temporal

source: |open_dir| |registry_save|: select a new temporary directory where temporary files are saved during processing; the path to the current temporary directory is displayed; default is a system temporary directory;
es: |open_dir| |registry_save|: selecciona un nuevo directorio temporal cuando los archivos temporales son guardados durante los procesamientos; la ruta del directorio temporal actual es mostrada; por defecto es el directorio temporal del sistema;

source: |reset|: reset to default temporary directory;
es: |reset|: restaura el directorio temporal al valor por defecto;
