Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/randomforesttab.po
Languages: es

source: Random Forest
es: Bosque Aleatorio

source: |cloud_masking_tool| :guilabel:`Random forest`
es: | cloud_masking_tool | : guilabel: `Bosque aleatorio`

source: This tool allows for the :ref:`random_forest_definition` classification, based on a :ref:`band_set_tab` and :ref:`training_input`.
es: Esta herramienta permite la clasificación: ref: `random_forest_definition`, basada en: ref:` band_set_tab` y: ref: `training_input`.

source: `ESA SNAP <http://step.esa.int/main/download/snap-download>`_ is required. The :guilabel:`ESA SNAP GPT executable` must be defined in :ref:`external_programs` settings.
es: ESA SNAP <http://step.esa.int/main/download/snap-download> `_ es obligatorio. El: guilabel: `ESA SNAP GPT ejecutable` debe estar definido en la configuración: ref:` external_programs`.

source: Random Forest classification
es: Clasificación de bosque aleatorio

source: :guilabel:`Select input band set` |input_number|: select the input :ref:`band_set_tab` to be classified;
es: : guilabel: `Seleccionar conjunto de bandas de entrada` | número_entrada |: seleccionar la entrada: ref:` band_set_tab` para ser clasificado;

source: :guilabel:`Use` |checkbox| :guilabel:`MC ID` |checkbox| :guilabel:`C ID` |registry_save|: if :guilabel:`MC ID` is checked, the classification is performed using the Macroclass ID (code `MC ID` of the signature); if :guilabel:`C ID` is checked, the classification is performed using the Class ID (code `C ID` of the signature);
es: : guilabel: ʻUsar` | casilla de verificación | : guilabel: `ID de MC` | casilla de verificación | : guilabel: `C ID` | registry_save |: si: guilabel:` MC ID` está marcado, la clasificación se realiza usando el ID de la macroclase (código `MC ID` de la firma); si: guilabel: `C ID` está marcado, la clasificación se realiza utilizando la Clase ID (código` C ID` de la firma);

source: :guilabel:`Number of training samples` |input_number|: set the number of training data (pixels) randomly used to traing the model; it should be set lower than total training input pixels;
es: : guilabel: `Número de muestras de entrenamiento` | input_number |: establece el número de datos de entrenamiento (píxeles) usados aleatoriamente para rastrear el modelo; debe establecerse por debajo del total de píxeles de la entrada de entrenamiento;

source: :guilabel:`Number of trees` |input_number|: set the number of decision trees; a higher number allows for more accurate models, but it also increases the calculation time;
es: : guilabel: `Número de árboles` | input_number |: establece el número de árboles de decisión; un número más alto permite modelos más precisos, pero también aumenta el tiempo de cálculo;

source: |checkbox| :guilabel:`Evaluate classifier`: if checked, the classifier is evaluated;
es: | casilla de verificación | : guilabel: `Evaluar clasificador`: si está marcado, se evalúa el clasificador;

source: |checkbox| :guilabel:`Evaluate feature power set` :guilabel:`Min` |input_number| :guilabel:`Max` |input_number|: if checked, evaluate the power set of input features (e.g. Gini decrease), according to the contribution thereof to the model; :guilabel:`Min` and :guilabel:`Max` are used as thresholds for power sets; it can increase the calculation time;
es: | casilla de verificación | : guilabel: `Evaluar conjunto de la capacidad de las características`: guilabel:` Min` | input_number | : guilabel: `Max` | input_number |: si está marcado, evalúe el conjunto de la capacidad de las características de entrada (por ejemplo, disminución de Gini), de acuerdo con la contribución de las mismas al modelo; : guilabel: `Min` y: guilabel:` Max` se utilizan como umbrales para conjuntos de la capacidad; puede aumentar el tiempo de cálculo;

source: |checkbox| :guilabel:`Save classifier`: if checked, save the classifier for later use;
es: | casilla de verificación | : guilabel: `Guardar clasificador`: si está marcado, guarde el clasificador para su uso posterior;

source: :guilabel:`Load classifier` |input_text| |open_file|: open a previously saved classifier; if loaded, the input :ref:`band_set_tab` is directly classified using this classifier;
es: : guilabel: `Cargar clasificador` | input_text | | open_file |: abre un clasificador previamente guardado; si se carga, la entrada: ref: `band_set_tab` se clasifica directamente usando este clasificador;

source: |reset|: clear the classifier;
es: |reset|: eliminar el clasificador;;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: select an output directory and start the classification process;
es: :guilabel:`RUN` |run|: seleccione un directorio de salida e inicie el proceso de clasificación;
