Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/reclassificationtab.po
Languages: es

source: Reclassification
es: Reclasificación

source: |reclassification_tool| :guilabel:`Reclassification`
es: |reclassification_tool| :guilabel:`Reclasificación`

source: This tab allows for the reclassification (i.e. assigning a new class code to raster pixels). In particular, it eases the conversion from C ID to MC ID values.
es: Esta pestaña permite la reclasificación (i.e. asignando un código de Clase nuevo a los pixeles ráster). En particular, facilita la conversión desde los valores C ID a MC ID.

source: This tool supports ``virtual raster output``; if the output file name ends with ``.vrt`` then the output is created as virtual raster composed of as many ``.tif`` files as the number of CPU threads defined in :ref:`system_processing`; for large rasters this can speed up the process.
es: Esta herramienta admite ''salida ráster virtual''; si el nombre del archivo de salida termina con ''.vrt'', la salida se crea como ráster virtual compuesto por varios archivos ''.tif'' como el número de subprocesos de CPU definidos en :ref:'system_processing'; para rásteres grandes, esto puede acelerar el proceso.

source: :guilabel:`Select the classification` |input_list|: select a classification raster (already loaded in QGIS);
es: :guilabel:`Selecciona la clasificación` |input_list|: selecciona un ráster de clasificación (ya cargadoen QGIS);

source: |reload|: refresh layer list;
es: |reload|: recargar la lista de capas;

source: Values
es: Valores

source: |checkbox| :guilabel:`calculate C ID to MC ID values`: if checked, the reclassification table is filled according to the :ref:`ROI_list` when :guilabel:`Calculate unique values` |enter| is clicked;
es: |checkbox| :guilabel:`calcular valores de C ID a MC ID`: si está seleccionado, la tabla de reclasificación table es completada de acuerdo con la :ref:`ROI_list` cuando :guilabel:`Calcular valores únicos` |enter| es presionado;

source: :guilabel:`Calculate unique values` |enter|: calculate unique values in the classification and fill the reclassification table;
es: :guilabel:`Calcular valores únicos` |enter|: calcula valores únicos en la clasificación y completa la tabla de reclasificación;

source: :guilabel:`Incremental new values` |enter|: calculate a new incremental value (e.g. 1, 2, 3, ...) for every old value and fill the reclassification table;
es: : guilabel: `Nuevos valores incrementales` | ingresar |: calcular un nuevo valor incremental (por ejemplo, 1, 2, 3, ...) para cada valor anterior y completar la tabla de reclasificación;

source: |input_table| :guilabel:`Values`: table containing the following fields;
es: |input_table| :guilabel:`Valores`: tabla conteniendo los siguientes campos;

source: |add|: add a row to the table;
es: |add|: agrega una fila a la tabla;

source: |remove|: remove highlighted rows from the table;
es: |remove|: elimina las filas resaltadas de la tabla;

source: Symbology
es: Simbología

source: |checkbox| :guilabel:`Use code from Signature list` |input_list|: if checked, color and class information are defined from :ref:`ROI_list`:
es: |checkbox| :guilabel:`Usar código del listado de Firmas` |input_list|: si está seleccionado, el color y la información de Clase son definidos desde :ref:`ROI_list`:

source: ``MC ID``: use the ID of macroclasses;
es: ``MC ID``: usar el ID de las Macroclases;

source: ``C ID``: use the ID of classes;
es: ``C ID``: usar el ID de las Clases;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: choose the output destination and start the calculation; reclassified raster is loaded in QGIS;
es: :guilabel:`RUN` |run|: elija el destino de salida y comience el cálculo; el ráster reclasificado se carga en QGIS;
