Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/reprojectrasterbandstab.po
Languages: es

source: Reproject raster bands
es: Reproyectar bandas ráster

source: |clip_tool| :guilabel:`Reproject raster bands`
es: |clip_tool| :guilabel:`Reproyectar bandas ráster`

source: This tab allows for reprojecting bands in a :ref:`band_set_tab` and perform other raster operations.
es: Esta pestaña permite reproyectar bandas en un: ref: `band_set_tab` y realizar otras operaciones ráster.

source: :guilabel:`Select input band set` |input_number|: select the input :ref:`band_set_tab` to be reprojected;
es: : guilabel: `Select input band set` | input_number |: seleccione la entrada: ref:` band_set_tab` a reproyectar;

source: |checkbox| :guilabel:`Align to raster` |checkbox| :guilabel:`same extent as reference` |input_list| |optional|: if :guilabel:`Align to raster` is checked, use the same coordinate reference system and pixel size as the selected reference; if :guilabel:`same extent as reference` is checked, the output extent will be the same as the reference;
es: | casilla de verificación | : guilabel: `Alinear con raster` | casilla de verificación | : guilabel: `misma extensión que la referencia` | input_list | | opcional |: si: guilabel: `Alinear al ráster` está marcado, use el mismo sistema de referencia de coordenadas y tamaño de píxel que la referencia seleccionada; si: guilabel: `misma extensión que la referencia` está marcada, la extensión de salida será la misma que la referencia;

source: |reload|: refresh layer list;
es: |reload|: recargar la lista de capas;

source: |checkbox| :guilabel:`Use EPSG code` |input_text| :guilabel:`X resolution` |input_text| :guilabel:`Y resolution` |input_text| |optional|: if checked, use the EPSG code for defining the output coordinate reference system with :guilabel:`X resolution` and :guilabel:`Y resolution`;
es: | casilla de verificación | : guilabel: `Usar códigos EPSG` | input_text | : guilabel: `Resolución X` | input_text | : guilabel: `Y resolución` | input_text | | opcional |: si está marcado, use el código EPSG para definir el sistema de referencia de coordenadas de salida con: guilabel: `resolución X` y: guilabel:` resolución Y`;

source: |checkbox| :guilabel:`Resample pixel factor` |input_text| |optional|: if checked, new pixel size will be the original size times this factor;
es: | casilla de verificación | : guilabel: `Volver a muestrear el factor de píxeles` | input_text | | opcional |: si se marca, el nuevo tamaño de píxel será el tamaño original multiplicado por este factor;

source: :guilabel:`Resampling method` |input_list|: select the resampling method; options are ``nearest_neighbour``, ``average``, ``sum``, ``maximum``, ``minimum``, ``mode``, ``median``, ``first_quartile``, ``third_quartile``;
es: : guilabel: `Método de remuestreo` | input_list |: seleccione el método de remuestreo; las opciones son `` vecino_más cercano '', `` promedio '', `` suma '', `` máximo '', `` mínimo '', `` moda '', `` mediana '', `` primer cuartil '', `` tercer cuartil '';

source: :guilabel:`Output type` |input_list|: select the output raster type; options are ``Auto`` (same as input), ``Float32``, ``Int32``, ``UInt32``, ``Int16``, ``UInt16``, ``Byte``;
es: : guilabel: `Tipo de salida` | lista_entrada |: seleccione el tipo de ráster de salida; las opciones son `` Auto '' (igual que la entrada), `` Float32 '', `` Int32 '', `` UInt32 '', `` Int16 '', `` UInt16 '', `` Byte '';

source: |checkbox| :guilabel:`Change output NoData value` |input_number| |optional|: if checked, set a new value for ``NoData`` pixels;
es: | casilla de verificación | : guilabel: `Cambiar el valor de salida NoData` | input_number | | opcional |: si está marcado, establezca un nuevo valor para los píxeles `` NoData '';

source: :guilabel:`Output name prefix` |input_text|: set the prefix for output file names (default is ``reproj``);
es: : guilabel: `Prefijo del nombre de salida` | input_text |: establesca el prefijo para los nombres de los archivos de salida (el valor predeterminado es` `reproj '');

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: choose an output destination and start the process;
es: :guilabel:`RUN` |run|: elija un destino de salida e inicie el proceso;
