Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/rgblisttab.po
Languages: es, uk_ua

source: RGB list
es: Lista RGB
uk_ua: Перелік RGB

source: |rgb_tool| :guilabel:`RGB list`
es: |rgb_tool| :guilabel:`Lista RGB`
uk_ua: |rgb_tool| :guilabel:`Перелік RGB`

source: This tab allows for managing the RGB :ref:`color_composite_definition` used in the list :guilabel:`RGB=` of the :ref:`image_control`.
es: Esta pestaña permite manipular las RGB :ref:`color_composite_definition` usadas en la lista :guilabel:`RGB=` de la :ref:`image_control`.
uk_ua: Дана вкладка відповідає за управління RGB :ref:`color_composite_definition`, що застосовується в переліку :guilabel:`RGB=` :ref:`image_control`.

source: |input_table| :guilabel:`RGB list`: table containing the following fields;
es: |input_table| :guilabel:`RGB list`: tabla conteniendo los siguientes campos;
uk_ua: |input_table| :guilabel:`Перелік RGB`: таблиця містить наступні поля;

source: :guilabel:`RGB`: RGB combination; this field can be manually edited;
es: :guilabel:`RGB`: combinación RGB; este campo puede ser modificado manualmente;
uk_ua: :guilabel:`RGB`: комбінація RGB; це поле редагується вручну;

source: |move_up|: move highlighted RGB combination upward;
es: |move_up|: mueve la combinación RGB resaltada hacia arriba;
uk_ua: |move_up|: перемістити виділену комбінацію RGB вгору;

source: |move_down|: move highlighted RGB combination downward;
es: |move_down|: mueve la combinación RGB resaltada hacia abajo;
uk_ua: |move_down|: перемістити виділену комбінацію RGB вниз;

source: |order_by_name| : automatically sort RGB combinations by name;
es: |order_by_name| : ordena automáticamente las combinaciones RGB por nombre;
uk_ua: |order_by_name| : автоматично впорядкувати комбінації RGB за ім'ям;

source: |add|: add a row to the table;
es: |add|: agrega una fila a la tabla;
uk_ua: |add|: додати рядок до таблиці;

source: |remove|: remove highlighted rows from the table;
es: |remove|: elimina las filas resaltadas de la tabla;
uk_ua: |remove|: видалити виділені рядки з таблиці;

source: |reset|: clear all RGB combinations from :guilabel:`RGB list`;
es: |reset|: elimina todas las combinaciones RGB de :guilabel:`RGB list`;
uk_ua: |reset|: видалити всі комбінації RGB з :guilabel:`Перелік RGB`;

source: |export|: export the :guilabel:`RGB list` to a file (i.e. ``.csv``);
es: |export|: exporta la :guilabel:`Lista RGB` a un archivo (i.e. ``.csv``);
uk_ua: |export|: експортувати :guilabel:`Перелік RGB` до файлу (наприклад, ``.csv``);

source: |import|: import a previously saved :guilabel:`RGB list` from file (i.e. ``.csv``);
es: |import|: importa una :guilabel:`Lista RGB` guardada anteriormente desde archivo (i.e. ``.csv``);
uk_ua: |import|: імпортувати попередньо збережений :guilabel:`Перелік RGB` з файлу (наприклад, ``.csv``);

source: Automatic RGB
es: RGB Automático
uk_ua: RGB автоматично

source: :guilabel:`Band combinations` |enter|: add the combinations of all bands (i.e. permutation) to the :ref:`RGB_list_table` (e.g. 1-2-3, 1-2-4, ..., 3-2-1);
es: :guilabel:`Combinaciones de bandas` |enter|: agrega la combinación de todas las bandas (i.e. permutación) a la :ref:`RGB_list_table` (e.g. 1-2-3, 1-2-4, ..., 3-2-1);
uk_ua: :guilabel:`Комібнації каналів` |enter|: додати комбінації всіх каналів (наприклад, переставкою) до :ref:`RGB_list_table` (наприклад, 1-2-3, 1-2-4, ..., 3-2-1);
