Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/sentinel2tab.po
Languages: es

source: This tab allows for the conversion of **Sentinel-2** images Level-1C to the physical measure of Top Of Atmosphere reflectance (TOA), or the application of a simple atmospheric correction using the DOS1 method (Dark Object Subtraction 1), which is an image-based technique (for more information about conversion to TOA and DOS1 correction, see :ref:`conversion_to_reflectance`). This tool can also convert **Sentinel-2** images Level-2A from DN to reflectance values.
es: Esta pestaña permite la conversión de imágenes ** Sentinel-2 ** Nivel-1C a la medida física de la reflectancia de la parte superior de la atmósfera (TOA), o la aplicación de una corrección atmosférica simple utilizando el método DOS1 (resta de objetos oscuros 1), que es una técnica basada en imágenes (para obtener más información sobre la conversión a TOA y corrección de DOS1, consulte: ref: `conversion_to_reflectance`). Esta herramienta también puede convertir imágenes ** Sentinel-2 ** Nivel-2A de DN a valores de reflectancia.

source: **WARNING**: For the best spectral precision you should download the Sentinel-2 Level-2A Products (Surface Reflectance) or use the official SNAP tool for atmospheric correction (see http://step.esa.int).
es: ** ADVERTENCIA **: Para obtener la mejor precisión espectral, debe descargar los productos Sentinel-2 Level-2A (Reflectancia de superficie) o utilizar la herramienta oficial SNAP para la corrección atmosférica (ver http://step.esa.int).

source: Sentinel-2 conversion
es: Conversión de Sentinel-2

source: :guilabel:`Directory containing Sentinel-2 bands` |open_dir|: open a directory containing Sentinel-2 bands; names of Sentinel-2 bands must end with the corresponding number; if the metadata file is included in this directory then :ref:`sentinel2_metadata` are automatically filled;
es: : guilabel: `Directorio que contiene bandas Sentinel-2` | open_dir |: abre un directorio que contiene bandas Sentinel-2; los nombres de las bandas Sentinel-2 deben terminar con el número correspondiente; si el archivo de metadatos está incluido en este directorio, entonces: ref: `sentinel2_metadata` se llenan automáticamente;

source: :guilabel:`Select metadata file` |open_file| |optional|: select the metadata file which is a .xml file whose name contains ``MTD_MSIL1C``); this is optional and can be generally ignored;
es: : guilabel: `Seleccionar archivo de metadatos` | open_file | | opcional |: seleccione el archivo de metadatos que es un archivo .xml cuyo nombre contiene `` MTD_MSIL1C ''); esto es opcional y generalmente se puede ignorar;

source: |checkbox| :guilabel:`Apply DOS1 atmospheric correction`: if checked, the :ref:`DOS1_correction` is applied to all the bands;
es: |checkbox| :guilabel:`Aplicar la corrección atmosférica DOS1`: si está seleccionado, la :ref:`DOS1_correction` es aplicada a todas las bandas;

source: |checkbox| :guilabel:`Use value as NoData` |input_number|: if checked, pixels having ``NoData`` value are not counted during conversion and the DOS1 calculation of DNmin; it is useful when image has a black border (usually pixel value = 0);
es: | casilla de verificación | : guilabel: `Usar valor como NoData` | input_number |: si está marcado, los píxeles que tienen el valor` `NoData '' no se cuentan durante la conversión y el cálculo DOS1 de DNmin; es útil cuando la imagen tiene un borde negro (normalmente el valor del píxel = 0);

source: |checkbox| :guilabel:`Preprocess bands 1, 9, 10`: if checked, preprocess also bands 1, 9, 10 (i.e. 60m bands);
es: | casilla de verificación | : guilabel: `Preprocesar bandas 1, 9, 10`: si está marcado, preprocesar también las bandas 1, 9, 10 (es decir, bandas de 60 m);

source: |checkbox| :guilabel:`Create Band set and use Band set tools`: if checked, bands are added to the active :guilabel:`Band set` after the conversion; also, the :guilabel:`Band set` is processed according to the tools checked in the :ref:`band_set_tab`;
es: |checkbox| :guilabel: `Crear conjunto de bandas y usar herramientas del conjunto de bandas`: si está marcado, las bandas se agregan al activo: guilabel:` Conjunto de bandas` después de la conversión;

source: |checkbox| :guilabel:`Add bands in a new Band set`: if checked, bands are added to a new empty :guilabel:`Band set` after the conversion;
es: |checkbox| : guilabel: `Agregar bandas en un nuevo conjunto de bandas`: si está marcado, las bandas se agregan a uno nuevo vacío: guilabel:` Grupo de bandas` después de la conversión;

source: **TIP**: in order to convert L2A images you should move all the .jp2 files inside the same directory and rename the files with the band number in the ending of the name (e.g. from name_02_10m.jp2 to name_02.jp2).
es: ** SUGERENCIA **: para convertir imágenes L2A, debe mover todos los archivos .jp2 dentro del mismo directorio y cambiar el nombre de los archivos con el número de banda al final del nombre (por ejemplo, de nombre_02_10m.jp2 a nombre_02.jp2).

source: Metadata
es: Metadatos

source: All the bands found in the :guilabel:`Directory containing Sentinel-2 bands` are listed in the table :guilabel:`Metadata`. If the Sentinel-2 metadata file (a .xml file whose name contains ``MTD_MSIL1C``) is provided, then :guilabel:`Metadata` are automatically filled. For information about :guilabel:`Metadata` fields read `this informative page <https://sentinel.esa.int/web/sentinel/user-guides/sentinel-2-msi/data-formats>`_ .
es: Todas las bandas encontradas en: guilabel: `Directorio que contiene bandas Sentinel-2` se enumeran en la tabla: guilabel:` Metadata`. Si se proporciona el archivo de metadatos Sentinel-2 (un archivo .xml cuyo nombre contiene `` MTD_MSIL1C ''), entonces: guilabel: `Metadata` se rellenan automáticamente. Para obtener información sobre: ​​guilabel: campos `Metadata`, lea` esta página informativa <https://sentinel.esa.int/web/sentinel/user-guides/sentinel-2-msi/data-formats> `_.

source: :guilabel:`Satellite` |input_text|: satellite name (e.g. Sentinel-2A);
es: :guilabel:`Satélite` |input_text|: nombre del satélite (Ej. Sentinel-2A);

source: |remove|: remove highlighted bands from the table :guilabel:`Metadata`;
es: |remove|: elimina las bandas seleccionadas de la tabla :guilabel:`Metadatos`;

source: |input_table| :guilabel:`Metadata`: table containing the following fields;
es: |input_table| :guilabel:`Metadatos`: tabla conteniendo los siguientes campos;

source: :guilabel:`Band`: band name;
es: :guilabel:`Band`: nombre de banda;

source: :guilabel:`Quantification value`: value for conversion to TOA reflectance;
es: :guilabel:`Valor de Cuantificación`: valor para la conversión a reflectancia TOA;

source: :guilabel:`Solar irradiance`: solar irradiance of band;
es: :guilabel:`Irradiancia solar`: irradiancia solar de la banda;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: select an output directory and start the conversion process; only bands listed in the table :guilabel:`Metadata` are converted; converted bands are saved in the output directory with the prefix ``RT_`` and automatically loaded in QGIS;
es: : guilabel: `RUN` | run |: seleccione un directorio de salida e inicie el proceso de conversión; solo las bandas que figuran en la tabla: guilabel: se convierten los 'Metadatos'; las bandas convertidas se guardan en el directorio de salida con el prefijo `` RT_`` y se cargan automáticamente en QGIS;
