Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/signaturethresholdtab.po
Languages: uk_ua

source: Signature threshold
uk_ua: Порогові величини сигнатур

source: |threshold_tool| :guilabel:`Signature threshold`
uk_ua: |threshold_tool| :guilabel:`Порогові величини сигнатур`

source: for Minimum Distance, pixels are unclassified if distance is greater than threshold value;
uk_ua: для Мінімальної відстані пікселі не класифікуються, якщо відстань більша за значення порогової величини;

source: for Maximum Likelihood, pixels are unclassified if probability is less than threshold value (max 100);
uk_ua: для Максимальної імовірності пікселі не класифікуються, якщо імовірність менша за значення порогової величини (максимально 100);

source: for Spectral Angle Mapping, pixels are unclassified if spectral angle distance is greater than threshold value (max 90).
uk_ua: для Картографування спектрального кута пікселі не класифікуються. якщо відстань спектрального кута більша за значення порогової величини (максимально 90).

source: |input_table| :guilabel:`Signature threshold`: table containing the following fields;
uk_ua: |input_table| :guilabel:`Порогова величина сигнатури`: таблиця містить наступні поля;

source: :guilabel:`MC ID`: signature Macroclass ID;
uk_ua: :guilabel:`MC ID`: унікальний ідентифікатор макрокласу сигнатури;

source: :guilabel:`C ID`: signature Class ID;
uk_ua: :guilabel:`C ID`: унікальний ідентифікатор класу сигнатури;

source: :guilabel:`MD Threshold`: Minimum Distance threshold; this value can be edited;
uk_ua: :guilabel:`Порогова величина MD`: порогова величина Мінімальної відстані; це значення редагується;

source: :guilabel:`ML Threshold`: Maximum Likelihood threshold; this value can be edited;
uk_ua: :guilabel:`Порогова величина ML`: порогова величина Максимальної імовірності; це значення редагується;

source: :guilabel:`SAM Threshold`: Spectral Angle Mapping threshold; this value can be edited;
uk_ua: :guilabel:`Порогова величина SAM`: порогова величина Картографуваня спектрального кута; це значення редагується;

source: |reset|: reset all signatures thresholds to 0 (i.e. no threshold used);
uk_ua: |reset|: повернути порогові величини всіх сигнатур до 0 (тобто жодна порогова величина не буде застосована);

source: Automatic thresholds
uk_ua: Автоматичні порогові величини

source: :guilabel:`Set threshold` |input_number| |enter|: set the defined value as threshold for all the highlighted signatures in the table;
uk_ua: :guilabel:`Призначити порогову величину` |input_number| |enter|: встановити визначене значення як для всіх виділених в таблиці сигнатур;

source: :guilabel:`Set threshold = σ *` |input_number| |enter|: for all the highlighted signatures, set an automatic threshold calculated as the distance (or angle) between mean signature and (mean signature + (σ * v)), where σ is the standard deviation and v is the defined value; currently works for Minimum Distance and Spectral Angle Mapping;
uk_ua: :guilabel:`Призначити порогову величину = σ *` |input_number| |enter|: для всіх виділених сигнатур встановити порогову величину автоматично розраховану як відстань (або кут) між середнім сигнатури та (середнє сигнатури + (σ * v)), де σ стандартне відхилення та v визначене значення; наразі працює для алгоритмів Мінімальної відстані та Картографування спектрального кута;
