Repository: rnanclares/SemiAutomaticClassificationManual
Catalog: locale/*/LC_MESSAGES/spectraldistancetab.po
Languages: es

source: Spectral distance
es: Distancia espectral

source: |spectral_distance| :guilabel:`Spectral distance`
es: |spectral_distance| :guilabel:`Distancia espectral`

source: **Parallel processing is available.**
es: ** El procesamiento en paralelo está disponible. **

source: Spectral distance of band sets
es: Distancia espectral de conjuntos de bandas

source: :guilabel:`Select first input band set` |input_number|: select the first input :ref:`band_set_tab`;
es: :guilabel:``Seleccione el primer conjunto de bandas de entrada`` |input_number|: seleccione la primera entrada :ref:`band_set_tab`;

source: :guilabel:`Select second input band set` |input_number|: select the second input :ref:`band_set_tab`;
es: :guilabel:`Seleccione el segundo conjunto de bandas de entrada` |input_number|: seleccione la segunda entrada:ref:`band_set_tab`;

source: :guilabel:`Distance algorithm` |radiobutton| :guilabel:`Minimum Distance` |radiobutton| :guilabel:`Spectral Angle Mapping`: select :ref:`minimum_distance_algorithm` or * :ref:`spectra_angle_mapping_algorithm` for spectral distance calculation;
es: :guilabel:`Algoritmo de distancia` |radiobutton| :guilabel:`Distancia minima` |radiobutton| :guilabel:`Mapeo de Ángulo Espectral`: seleccione :ref:`minimum_distance_algorithm` o * :ref:`spectra_angle_mapping_algorithm` para cálculo de distancia espectral;

source: |checkbox| :guilabel:`Distance threshold` |input_number|: if checked, a binary raster of values below and above the threshold is created;
es: |checkbox| :guilabel: `Umbral de distancia` |input_number|: si está marcado, se crea un ráster binario de valores por debajo y por encima del umbral;

source: :guilabel:`BATCH` |batch_tool|: add this function to the :ref:`batch_tab`;
es: : guilabel: `BATCH` | batch_tool |: agrega esta función a: ref:` batch_tab`;

source: :guilabel:`RUN` |run|: choose the output destination and start the calculation;
es: :guilabel:`RUN` |run|: elija el destino de salida y comience el cálculo;
